[
    {
        "url": "https://www.wsj.com/politics/policy/trump-wants-to-remake-the-sports-world-too-65bcec34?mod=WTRN_pos1&cx_testId=&cx_testVariant=cx_&cx_artPos=0",
        "datetime": "May 23, 2025 11:34 AM ET",
        "title": "Trump Wants to Remake the Sports World Too",
        "dek": "The president has strong views on everything from the NFL’s kickoff rules to how college players get paid, and he’s not bashful about using the power of his office to rewrite the rules of the game",
        "subheadline": "On the screens, sports controversies Trump has waded into: the ban of Pete Rose from baseball’s Hall of Fame, the Philadelphia Eagles’ ‘tush push’ play, Luka Doncic’s trade to the L.A. Lakers.",
        "image_url": "https://images.wsj.net/im-83006272?width=1280&size=1.463&pixel_ratio=3",
        "article_text": "Give President Trump the chance to banter, and he often sounds like the guy on the next bar stool, eager to opine about the game on TV. Pro football’s new kickoff rule, he insists, is ruining the game. Trading NBA powerhouseLuka Doncicfrom the Mavericks to the Lakers was a terrible move. And Major League Baseball “should get off its fat, lazy ass” and finally put the Cincinnati Reds’Pete Rosein the Hall of Fame.\nBut unlike other fans, Trump has direct lines to elite athletes and the commissioners of the major sports leagues. He has been using those connections not just to share his strong opinions but to shape his image, engage in international diplomacy and, in some cases, to intervene in America’s sports establishments as he has in other major sectors of American business."
    },
    {
        "url": "https://www.wsj.com/us-news/law/trump-judges-security-marshals-6e080ac6?mod=trending_now_news_4",
        "datetime": "May 24, 2025 09:00 PM ET",
        "title": "Judges Weigh Taking Control of Their Own Security Amid Threats",
        "dek": "U.S. marshals, sworn to protect federal judges, ultimately answer to President Trump, who has ramped up criticism of the judiciary",
        "subheadline": "Security officials keep watch as demonstrators protest in front of the federal courthouse where a Wisconsin state judge appeared on charges of helping an undocumented immigrant avoid arrest",
        "image_url": "https://images.wsj.net/im-42242959?width=1280&size=1.000&pixel_ratio=3",
        "article_text": "Amid rising tensions between the Trump administration and the judiciary, some federal judges are beginning to discuss the idea of managing their own armed security force.\nThe notion came up in a series of closed-door meetings in early March, when a group of roughly 50 judges met in Washington for a semiannual meeting of the Judicial Conference, a policymaking body for the federal judiciary. There, members of a security committee spoke about threats emerging as President Trump stepped up criticism of those who rule against his policies."
    },
    {
        "url": "https://www.wsj.com/lifestyle/harvard-business-school-celebrity-visits-8505ab04?mod=WTRN_pos4&cx_testId=&cx_testVariant=cx_&cx_artPos=3",
        "datetime": "May 16, 2025 05:30 AM ET",
        "title": "Celebrities’ Toughest Get: An Invitation to Harvard Business School",
        "dek": "Speaking at the prestigious program is on these A-listers’ bucket lists, and their teams are inundating the school with requests; ‘I don’t even have a degree’",
        "subheadline": "Harvard Business School has rolled out the red carpet for celebrities and influencers, including Alix Earle.",
        "image_url": "https://images.wsj.net/im-92397056?width=1280&size=1.501&pixel_ratio=3",
        "article_text": "Harvard Business School rivaled a Coachella party this spring with its roster of speakers.\nInfluencer and entrepreneur Alix Earle talked about brand building and hobnobbed with students over canned margaritas. The day after, Marcello Hernández of “Saturday Night Live”addressed the entertainment clubabout Cuban culture with his feet propped on a desk. Musicians Lauryn Hill and Billie Eilish’s brother Finneas spoke about fame and creativity."
    },
    {
        "url": "https://www.wsj.com/finance/investing/trumps-war-against-higher-education-hits-the-sectors-bonds-01cc197b?mod=WTRN_pos2&cx_testId=&cx_testVariant=cx_&cx_artPos=1",
        "datetime": "May 22, 2025 10:26 AM ET",
        "title": "Trump’s War Against Higher Education Hits the Sector’s Bonds",
        "dek": "Analysis say the threat is contributing to an increase in the yields investors are demanding to finance higher education",
        "subheadline": "The Trump administration’s moves against prominent colleges and universities have spread concerns that a wide swath of higher-education institutions could see their borrowing costs rise.",
        "image_url": "https://images.wsj.net/im-45082947?width=700&size=1.5&pixel_ratio=3",
        "article_text": "The Trump administration’s moves against prominent colleges and universities have spread concerns that a wide swath of higher-education institutions could see their borrowing costs rise, while some investors could end up with a win.\nPresident Trump and the Republican-controlled Congress have discussed increasing taxation on, limiting tax benefits for and curbing federal funds to colleges and universities. The rising hostility has municipal-bond investors worried that higher-education institutions could lose an exemption that allows the buyers of their bonds to avoid federal income taxes on their returns."
    },
    {
        "url": "https://www.wsj.com/style/hamptons-weekend-cost-influencers-surf-lodge-wolffer-chanel-060bacf6?mod=WTRN_pos2&cx_testId=3&cx_testVariant=cx_164&cx_artPos=1",
        "datetime": "May 25, 2025 05:30 AM ET",
        "title": "The Jaw-Dropping Cost of a Hamptons Girls’ Weekend",
        "dek": "Between $97 lobster salads, $950 bottle service and $4,000 rental homes, an Instagram-worthy weekend out east has become a four-figure-per-person affair",
        "subheadline": "A perfect Hamptons girls’ weekend often includes partying at Surf Lodge, sometimes with $950 Casamigos bottle service.",
        "image_url": "https://images.wsj.net/im-28863063?width=700&size=1.333&pixel_ratio=3",
        "article_text": "Today’s picture-perfect girls’ trip to the Hamptons follows a strict itinerary: Wake up lightly hungover from last night’s debauchery. Swing by Carissa’s the Bakery for an $8 matcha latte and $7 almond croissant. Hit up theTracy Andersongym in Water Mill for a $75 workout class to “sweat out the toxins.” Stop by Duryea’s restaurant for a $97 lobster salad. Stroll through East Hampton Village to shop and take a selfie in front of thecottage-coreChanel store. Head toWölffer Estate Vineyardfor a $36 rosé tasting flight and a $35 “girl dinner” cheeseboard. Finish the night at Surf Lodge with $950 Casamigos bottle service.\nIt’s not really about the beach."
    }
]