{
  "title": "April 28: Israeli sources quickly deny claim of ‘breakthrough’ in hostage-ceasefire talks",
  "url": "https://www.timesofisrael.com/liveblog-april-28-2025/",
  "entries": [
    {
      "time": "11:54 pm",
      "headline": "Report: Security establishment shocked Netanyahu revealed classified details of beeper op",
      "content": "The security establishment was stunned to hear Prime Minister Benjamin Netanyahureveal classified detailsof the September 2024 beeper and walkie-talkie operation against Hezbollah in a speech last night, Channel 12 reports. Speaking at the Jewish News Syndicate conference, Netanyahu said that Israel bombed the scanning machine that Iran sent to Lebanon once Hezbollah suspected that its beepers were booby-trapped, and took out its operator as well. “We learned that Hezbollah had sent three beepers to be scanned in Iran; we had previously bombed the scanner they were going to bring in, so we got rid of that, and the guy who operates it,” he said. These details had been censored repeatedly because they would expose intelligence sources, and thus harm national security, according to the report. As prime minister, Netanyahu can legally reveal heretofore classified material, but this is usually done in consultation with the relevant security services to ensure that no harm will come from the revelation. No such coordination was done this time, claims Channel 12.",
      "author": "Lazar Berman"
    },
    {
      "time": "11:51 pm",
      "headline": "Olympic Committee of Israel incorporates handwriting of fallen soldier into logo to mark Memorial Day",
      "content": "To mark Memorial Day, the Olympic Committee of Israel changes its official logo to incorporate the handwriting of slainCpt. Eden Nimri, a professional swimmer, who was killed at the Nahal Oz IDF base on October 7, 2023. The word Israel in Hebrew is written in Nimri’s handwriting in the logo that the Olympic Committee and many of Israel’s Olympic athletes will share across social media this week as the country remembers its fallen. Nimri was a member of the Israeli youth swimming team and represented the country abroad, including at the 2018 European Junior Open Water Swimming Championships and the International School Sport Federation’s 2017 World Championships. Nimri, a commander of an all-female team in the elite “Sky Riders” unit, was killed on October 7, while battling Hamas gunmen attacking the on-base bomb shelter, allowing 11 other soldiers to run for safety. “This is the second Memorial Day without Eden, but her inspiration and her bravery are always with us,” her mother, Sharon, says in a statement shared by the Olympic Committee. “The decision to memorialize her through her handwriting is moving and profound.”",
      "author": "Amy Spiro"
    },
    {
      "time": "11:23 pm",
      "headline": "Security sources report ‘significant breakthrough’ in hostage-ceasefire talks in Cairo",
      "content": "Negotiations held in Cairo to reach a ceasefire in Gaza are witnessing a “significant breakthrough,” two Egyptian security sources tell Reuters. The sources say there is a consensus on a long-term ceasefire in the besieged enclave, yet some sticking points remain, including Hamas arms. A senior Israeli officialsaid earlier todaythat Israel would not accept a five-year ceasefire deal being pushed for by mediators. Earlier, Egyptian state-affiliated Al Qahera News TV reported that Egyptian intelligence chief General Hassan Mahmoud Rashad was set to meet an Israeli delegation headed by Strategic Affairs Minister Ron Dermer in Cairo.",
      "author": "ReutersandToI Staff"
    },
    {
      "time": "11:15 pm",
      "headline": "Fighter jet slips off hangar deck of a US aircraft carrier in the Red Sea",
      "content": "An F/A-18 fighter jet slipped off the hangar deck of an aircraft carrier deployed to the Middle East, as sailors were towing the aircraft into place, in the hangar bay of the USS Harry S. Truman today, the Navy says. The crew members who were in the pilot seat of the Super Hornet and on the small towing tractor both jumped out before the jet and the tug went into the Red Sea. According to a defense official, the sailor who jumped from the aircraft sustained a minor injury. The official spoke on condition of anonymity to discuss personnel details. “The F/A-18E was actively under tow in the hangar bay when the move crew lost control of the aircraft. The aircraft and tow tractor were lost overboard,” the Navy says in a statement. The jet was part of Strike Fighter Squadron 136. Fighter jets are routinely towed around the hangar deck to park them where they are needed for any flight operations or other work. It is unclear whether there will be an effort to recover the jet, which costs about $60 million. The incident is under investigation. The Truman has been deployed to the Middle East for months and recently has been involved in stepped-up military operations against the Yemen-based Houthi rebels.",
      "author": "AP"
    },
    {
      "time": "11:04 pm",
      "headline": "Report: PM offering Haredi parties boosted budgets to quell coalition rebellion over draft bill",
      "content": "Prime Minister Benjamin Netanyahu is engaged in negotiations with his coalition’s ultra-Orthodox parties, offering the Haredi sector increased budgets in an effort to head off the demand by senior rabbis that a bill exempting yeshiva students from military service be passed by the beginning of June, Channel 12 reports. According to the report, Netanyahu is trying to buy time and keep his coalition partners happy, despite the failure to pass the controversial legislation, whose advancement has been stymied by Knesset Foreign Affairs and Defense Committee chairman Yuli Edelstein (Likud). “Netanyahu is once again trying to buy political peace with a lot of money, the same method that has already led Israel to the most terrible disaster in the country’s history,” tweets Yisrael Beytenu chairman Avigdor Liberman. “The same patterns of action, the same people, the same mismanagement. If we don’t stop them — the next disaster is only a matter of time.” The ultra-Orthodox United Torah Judaism (UTJ) party has reportedly decided that it would pursue an independent course during the upcoming summer legislative session, which starts on May 4, if no progress is made on the bill. “There are two ways to leave a coalition. There is the option to leave by slamming the door, and there is the option to leave little by little. We are choosing the second way,” a senior party official told the Maariv daily last week. Edelstein, who has pledged that he will “only produce a real conscription law that will significantly increase the IDF’s conscription base,” said yesterday that his committee was nearing a final draft of the law, and that he would “not accept ultimatums from any side.”",
      "author": "Sam Sokol"
    },
    {
      "time": "10:46 pm",
      "headline": "Dermer predicts war will be over in a year, says he had to tell Trump not all hostages were dead",
      "content": "In November, US President Donald Trump thought all the hostages remaining in Gaza were dead, says Strategic Affairs Minister Ron Dermer, speaking at the Jewish News Syndicate conference in Jerusalem. “I corrected him and I said, no, there are 51 who are alive,” recounts Dermer, who says the meeting took place at Trump’s Mar-A-Lago resort in Florida. Israel is spending a significant amount of time and energy discussing plans for the “day after” Hamas, says Dermer: “Just because Israel doesn’t put out a plan every five minutes doesn’t mean we’re not dealing with it.” Israel is in the “back stretch” of the war against Hamas, he says, adding that “we need to get to the home stretch, and we need to finish this war by winning this war.” A year from now, he predicts, “the seven-front war that began on October 7 will be over. Israel will have won. And I think you will see many peace agreements, either that have been forged, or will be forged in the coming years of President Trump’s presidency.” “The key to that is victory,” he stresses. In order to secure that victory over the long term, Israel must focus on the deradicalization of Palestinian society, Dermer argues. “We should be magnanimous in victory, then link the development of Gaza to the deradicalization,” says Dermer. He points at Saudi Arabia as an example of a society that is moving away from radicalism: “Saudi Arabia today has much greater degrees of freedom in its society. It’s not a democracy by any stretch. But look at the status of women in Saudi Arabia compared to what it was once.” Speaking about the security challenges on the northern border, Dermer says that Israel did not know that Syrian President Bashar Al-Assad was going to fall, and repeats Prime Minister Benjamin Netanyahu’s revelation that Israel prevented Iranian reinforcements from arriving. He also pledges that Israel will continue operating in Lebanon, despite an ongoing ceasefire. “We’re going to continue to enforce the deal so that Hezbollah cannot rearm itself,” he says.",
      "author": "Lazar Berman"
    },
    {
      "time": "10:28 pm",
      "headline": "8 cases of measles have been diagnosed in Israel in past week, says health ministry",
      "content": "The Health Ministry reports eight cases of measles from the Tel Aviv and Bnei Brak region, Emek Hefer and Modiin Illit, which have been diagnosed since April 20, with six of the cases in unvaccinated patients. According to the epidemiological investigation, four of the patients contracted the disease abroad or through contact with people who had recently returned from abroad. The investigation regarding the other cases is ongoing. The ministry emphasizes that anyone who has been in contact with a measles patient should continue testing and vaccinating according to its guidelines. It also recommends that unvaccinated pregnant women, immunosuppressed individuals, and infants who may have been exposed to a measles patient consult with their healthcare providers to determine whether “passive immunization” against measles is possible and makes sense for them. The ministry also recommends checking vaccination status and getting vaccinated before traveling abroad, especially to countries known to have significant measles outbreaks. Measles is a highly contagious viral disease characterized by fever, general malaise, runny nose and a rash, and it can cause serious and even life-threatening complications.",
      "author": "Diana Bletter"
    },
    {
      "time": "10:23 pm",
      "headline": "Bar’s resignation throws High Court case against his dismissal toward a new path",
      "content": "Following Shin Bet chiefRonen Bar’s announcementthat he will be retiring on June 15, the High Court of Justice needs to decide how to proceed with the petitions before it which asked that it annul the government’s decision to fire Bar. The court will probably start by asking both the petitioners and the government for their position. The government will likely request that the interim order freezing Bar’s dismissal be rescinded, citing the importance to Israeli security of having a Shin Bet chief who can work with the government. The petitioners may either ask that the court nevertheless rule on the merits of the case, or possibly request that the court instruct Netanyahu not to be involved in the appointment of a new Shin Bet head due to a conflict of interest over the criminal investigations the Shin Bet is conducting into the prime minister’s close aides. It seems unlikely that the court will issue a final ruling on the merits of the case however, since the practical issue, Bar’s tenure as Shin Bet chief, is now moot. The petitioners alleged that procedural flaws with the decision to fire Bar and what they said were political considerations in the decision rendered it unlawful. But the court will also be disinclined to rescind the interim order and allow the government to fire Bar, given the concern the judges expressed over the procedural flaws in the decision to remove him and a reticence to be seen as affirming the government’s decision. Even if the court decides to dismiss the petitions, it could still make principled statements in its decision about the obligation for the government to use only professional considerations when hiring a Shin Bet chief, and indeed when firing one.",
      "author": "Jeremy Sharon"
    },
    {
      "time": "9:53 pm",
      "headline": "Herzog to UN envoys: Israel seeks peace with Palestinians, Saudis, must stop Iran",
      "content": "Israel is committed to advancing peace with its Arab neighbors, President Isaac Herzog tells a delegation of dozens of United Nations ambassadors, while urging action against Iranian nuclear power and calling for reform in the policies of international bodies toward Israel. “We have to always remember that we have to be very strong, together with our allies, and keep on pursuing the hope for peace in our region, with our neighbors the Palestinians, hopefully with the Saudis, so that we can open the road to rapprochement for Jews and Muslims,” Herzog tells the group in a meeting at the President’s Residence, according to his office. “Here in Israel, we live together with Muslims, Christians, and, of course, a Jewish majority in an incredible, unique relationship and a vibrant democracy,” he says to more than 30 envoys from European Union member states, Latin America, the Pacific Islands, and sub-Saharan Africa. Led by Israel’s Ambassador to the UN Danny Danon, the delegation participated in last week’s annual March of the Living ceremony in Poland, before flying to Israel and touring areas in the south attacked by Hamas on October 7, 2023. Herzog tells the ambassadors that Hamas attacked “the most tranquil, peaceful communities in the region, pursuing peace with their Palestinian neighbors, living in harmony and on a recognized international boundary.” He says the immediate release of all remaining hostages in Gaza “has to be a top priority of the world.” The president addresses Iran and its proxies, saying Israel was “attacked from seven different corners of the earth by the same empire of evil,” and “that’s why we have to knock it hard so that they are not able to have nuclear capability and also stop fighting.” He further adds that Israel “expect[s] major change in the behavior of the international institutions: an end to hypocrisy, and much more fairness… That’s all we demand.”",
      "author": "Nava Freiberg"
    },
    {
      "time": "9:45 pm",
      "headline": "Lapid praises Ronen Bar for ‘taking responsibility’ and resigning as Shin Bet chief",
      "content": "Opposition Leader Yair Lapid welcomes Shin Bet chief Ronen Bar’sannouncement that hewill resign on June 15, citing personal responsibility for his agency’s failure to prevent the October 7 Hamas attack. “Ronen Bar made the right and appropriate decision. This is what taking responsibility looks like,” Lapid tweets. “Of those responsible for the greatest failure in the country’s history, only one remains holding on to his chair,” Lapid adds, referring to Prime Minister Benjamin Netanyahu. “The people of Israel deserve elections now.” Lapid is echoed by The Democrats party chief Yair Golan, who tweets, “Thank you Ronen. Netanyahu, it’s now your turn.” National Unity party chief Benny Gantz says that “Ronen and the Shin Bet failed on October 7. Ronen fulfilled his responsibility throughout the war in the face of all challenges and in all arenas. He did the same today in his decision to resign.” Gantz adds that it is “appropriate and right that the political echelon also fulfills the same responsibility.” Right-wing lawmakers take a different approach, continuing their attacks on the veteran security official. “Ronen Bar is not doing anyone a favor by leaving. As of April 10, Ronen Bar is the illegal head of the Shin Bet, and in a civilized country, he would already have been handcuffed and detained with rats, both for rebelling against the elected government that legally fired him, and also to be asked difficult questions about other serious matters,” tweets Likud MK Ariel Kallner — declaring that “the struggle against the crazy Israeli Deep State has not even begun.” Fellow Likud MK Avichai Boaron calls Bar “rude, arrogant [and] smug,” asserting that such an approach led to October 7, while far-right Noam party MK Avi Maoz declares, “You didn’t resign. You were fired.”",
      "author": "Sam Sokol"
    },
    {
      "time": "9:30 pm",
      "headline": "Despite protest, Goldknopf refuses to step back from Memorial Day ceremony at cemetery",
      "content": "Several bereaved families from Kiryat Gat have called on Housing and Construction Minister Yitzhak Goldknopf, head of the ultra-Orthodox United Torah Judaism party, not to attend the upcoming Memorial Day ceremony at the city’s military cemetery, but the minister has indicated that he will attend regardless, Channel 12 reports. In a letter addressed to the minister, the families wrote: “We, several bereaved families from Kiryat Gat, ask you in every way possible not to attend the Memorial Day ceremony for IDF fallen soldiers in Kiryat Gat.” “We believe that someone representing groups in Israeli society who refuse to bear the burden of military service cannot stand before bereaved parents and speak on a day that is so sacred to us,” they added. In light of recent tensions over military draft exemptions, the families wrote, “We would prefer that you invest your time in recruiting yeshiva students and not come to the cemeteries to speak to the bereaved families.” In response, close associates of Goldknopf tell Channel 12 that “no negotiations are underway to replace him” and that he fully intends to attend the event. Last year, Goldknopf was also assigned to the Kiryat Gat cemetery, sparking outrage among many bereaved families. However, he ultimately respected their wishes not to attend.",
      "author": "Stav Levaton"
    },
    {
      "time": "9:21 pm",
      "headline": "Ron Dermer says he is confident Trump would reject a ‘bad’ Iran deal",
      "content": "Strategic Affairs Minister Ron Dermer says he believes US President Donald Trump would not agree to a “bad” nuclear agreement with Iran. “I have a lot of confidence that President Trump would walk away from a bad deal today,” Dermer says on a panel at a conference in Jerusalem organized by the Jewish News Syndicate. Asked whether Israel would be willing to strike Iran’s “military facilities” by itself, Dermer says he would not “talk about operational issues,” but that Prime Minister Benjamin Netanyahu should be believed when he said he would do whatever it takes to prevent Iran developing a nuclear weapon.",
      "author": "Reuters"
    },
    {
      "time": "9:06 pm",
      "headline": "Ronen Bar announces he will step down as Shin Bet chief on June 15, says all leaders must take responsibility",
      "content": "Shin Bet chief Ronen Bar announces that he will step down from his position on June 15, citing personal responsibility for the agency’s failure to prevent the October 7 Hamas attack. Speaking at a memorial event for fallen Shin Bet personnel, Bar says that after “years [operating] on many fronts,” the agency “failed in providing an early warning” that day. “All systems collapsed.” “As the head of the organization, I took responsibility for this — and now, on this special evening, symbolizing remembrance, bravery, and sacrifice, I have chosen to announce the fulfillment of that responsibility and my decision to end my tenure as head of the Shin Bet,” he says. “In light of the magnitude” of the October 7 event, Bar continues, “all of us — those who chose public service and the defense of the state’s security as our life mission, and who failed to provide a protective covering that day — must bow our heads humbly before the murdered, the fallen, the wounded, the abducted and their families, and act accordingly. All of us.” In comments that might also be seen as directed at Prime Minister Benjamin Netanyahu, who has rejected the idea of resigning over October 7, Bar goes on: “The fulfillment of responsibility in practice is an inseparable part of personal example and the legacy of our leaders — and we have no legitimacy to lead without it.” At Netanyahu’s recommendation, the cabinet last month voted unanimously to dismiss Bar, prompting an ongoing legal battle, with petitions against the dismissal currently being considered by the High Court of Justice. The prime minister has said he lost faith in Bar, and castigated him over the October 7 failures. Bar has contested his dismissal as illegitimate, and argued that Netanyahu ousted him for personal and political reasons. In an affidavit last week, he claimed that Netanyahu demanded that he be loyal to the prime minister over the courts, said Netanyahu sought to misuse the Shin Bet’s powers, and warned that the future independence and integrity of the service are imperiled. Netanyahu issued an affidavit countering the claims yesterday. Bar relates to some of his concerns in his speech, saying of the Shin Bet: “This is an organization whose proper functioning is of priceless importance to the security of the state and to Israeli democracy. Over the past month, I fought for this, and this week, all the necessary groundwork was laid before the High Court of Justice, and I hope that its verdict will ensure that the Shin Bet remains so — for the long term and without fear.” He specifies that the agency must be provided with “institutional protections that will allow every Shin Bet chief to fulfill their role, subject to government policy and for the public good, independently and free of pressure. And thus — to draw the clear line that distinguishes between trust and loyalty.” Bar says that the ongoing proceedings “are not about my personal case but about the independence of future Shin Bet chiefs,” stressing that he is willing to continue to cooperate with the High Court on the case moving forward. Nonetheless, he concludes, “after 35 years of service,” he will step down on June 15 in order to allow for an orderly process of appointing his successor and guiding them during the handover period. “My love for my homeland and loyalty to the state have been the foundation of every professional decision I have made — so too this evening.”",
      "author": "Stav Levaton"
    },
    {
      "time": "8:52 pm",
      "headline": "Egypt’s intelligence chief reportedly set to discuss Gaza with Ron Dermer in Cairo",
      "content": "Egypt’s intelligence chief General Hassan Mahmoud Rashad is set to soon meet an Israeli delegation headed by Strategic Affairs Minister Ron Dermer in Cairo, the Egyptian state-affiliated Al Qahera News TV reports. The meeting is part of Qatar-Egyptian efforts to restore a ceasefire between Israel and Hamas in Gaza, the channel says.",
      "author": "Reuters"
    },
    {
      "time": "8:50 pm",
      "headline": "New US envoy Huckabee praises Trump for reversing ‘ridiculous policies’ of Biden White House",
      "content": "In an overtly religious speech that is explicitly eschatological in tone, US Ambassador to Israel Mike Huckabee declares that “Israel is a chosen place for a chosen people” and that the Jewish state’s struggle against its enemies constitutes a “battle between heaven and hell, between good and evil, between light and darkness.” Addressing a conference hosted by the Jewish News Syndicate in Jerusalem, the former Arkansas governor praises US President Donald Trump for having “reversed a lot of the ridiculous policies of the previous administration, one of which was to not give Israel the necessary tools to fight a war against the worst savages that we have seen, not just in our century, but perhaps in human history.” Stating he is “convinced today that what the world needs is a real dose of understanding what people are up against, who live in this, the most contested piece of real estate on God’s entire planet,” Huckabee declares that Israel is engaged in a conflict against “people who are evil.” “This is not a geopolitical struggle. The left versus the right, the liberal versus the conservative. This is a vertical battle between heaven and hell, between good and evil, between light and darkness. And one of the reasons that I am so grateful to God to be here is to make sure that not just here in Israel, but across the world, people understand that the United States of America and President Trump stand for good and not evil,” he says. Huckabee says that when asked about his primary objectives, “the first thing is let’s get the hostages home. Let’s get them home now, every last one of them,” he continues — adding that Americans need to understand that “America benefits greatly from its relationship to Israel,” a state which is “a chosen place for a chosen people, for a chosen purpose.” “And I say that not because I’m Jewish, I say it because it’s true,” Huckabee, an evangelical Christian, asserts. “And I realize there are a lot of people who don’t want to get into the spiritual side of things and just sort of dismiss that. But, folks, there is no explanation for the United States of America other than that there was a God who intervened on behalf of those incredible colonists who truly thought that it was better to die than it was to live as slaves and under a tyranny.” Turning to the issue of Jerusalem, Huckabee says that the land was gifted to the biblical forefathers thousands of years ago and that “if there ever was a time that the city of Jerusalem should be absolutely recognized as the indisputable, undivided capital of the Jewish people, it is now.” “And I’m glad Donald Trump, the president, admitted and acknowledged that,” he adds.",
      "author": "Sam Sokol"
    },
    {
      "time": "8:27 pm",
      "headline": "Iran calls deadly US strikes on Yemen a ‘war crime’",
      "content": "Iran condemns US strikes on Yemen that Houthi rebels claimed hit a migrant detention center in the Tehran-backed rebel group’s stronghold of Saada, killing at least 68 people. In a statement, foreign ministry spokesman Esmaeil Baqaei calls the strikes “on civilian targets, vital infrastructure, and people’s homes in various parts of Yemen… a war crime.”",
      "author": "AFP"
    },
    {
      "time": "8:14 pm",
      "headline": "IDF publishes footage of airstrike yesterday on Hezbollah facility in Beirut",
      "content": "The IDF publishes footage showing yesterday’s airstrike in Beirut, targeting what the military said was a facility used by Hezbollah to store precision missiles. Over the past month, the military says it struck more than 50 targets in Lebanon. “These strikes were carried out following violations of the understandings between Israel and Lebanon, which pose a threat to the State of Israel and its citizens,” the IDF adds. ",
      "author": "Emanuel Fabian"
    },
    {
      "time": "8:02 pm",
      "headline": "Hostage pointman Gal Hirsch briefs ambassadors of countries with hostages in Gaza",
      "content": "Government hostage pointman Gal Hirsch briefs foreign ambassadors with citizens held hostage by Hamas, says the Prime Minister’s Office. According to the PMO, Hirsch updates them on the hostage talks, and discusses with the diplomats “topics that demand coordination and cooperation” in bringing back all the hostages.",
      "author": "Lazar Berman"
    },
    {
      "time": "7:56 pm",
      "headline": "Barkat says Israel has proposed upgrading its free trade agreement with the US",
      "content": "Israel has proposed revamping its four-decade-old free trade agreement with the United States, its economy minister says, as it looks to head off tariffs from its closest ally. An upgraded trade pact would ease restrictions on data sharing that would enable significant collaboration, Economy Minister Nir Barkat tells Reuters at a conference in Jerusalem. He says Israel has already agreed to several requests, which included lifting tariffs on US agricultural goods. Most US goods are already exempt from Israeli tariffs under a 1985 trade deal. The US is Israel’s biggest trading partner with bilateral trade worth an estimated $37 billion in 2024, according to US trade data. Last year, Israel had a $7.4 billion trade surplus with the United States. US President Donald Trump’s administration this month announced sweeping tariffs on dozens of countries, including a 17% levy on Israeli imports, before saying there would be a 90-day pause with a baseline 10% tariff on imports to allow for trade negotiations. Prior to the sweeping tariffs announcement, Israel said it would lift all remaining import duties on US goods, and Prime Minister Benjamin Netanyahu met with Trump in Washington, though he did not appear to make progress on the issue.",
      "author": "Reuters"
    },
    {
      "time": "7:33 pm",
      "headline": "Death toll rises to 65 in Iran port explosion as fire still blazes",
      "content": "A huge explosion at Iran’s largest commercial port has killed 65 people, the provincial governor tells state media, revising earlier tolls for the blast. “The death toll has reached 65 in this horrific incident” at Shahid Rajaee Port, says Mohammad Ashouri, governor of the southern Iranian province of Hormozgan where the port is located, adding that the fire caused by the explosion on Saturday has not yet been fully extinguished.",
      "author": "AFP"
    },
    {
      "time": "7:17 pm",
      "headline": "Ex-hostage Keith Siegel recounts ‘medieval torture’ in Gaza, asks Trump to ‘apply pressure’",
      "content": "Speaking at a English press conference of freed hostages, released captive Keith Siegel recounts the horrors he experienced in captivity and appeals to US President Donald Trump not to stop until every captive is returned home. Siegel, a native of the US, says he is “eternally thankful to President Trump for prioritizing the hostage crisis since day one of his presidency, and bringing me and so many others home.” Siegel was kidnapped from Kibbutz Kfar Aza on October 7, 2023, with his wife, Aviva, who was freed in November 2023. He was not released until February 2025. Siegel says he thinks “constantly” of those still being held hostage, including twinsGali and Ziv Berman, who “have been part of our lives since they were little boys,” IDF soldierMatan Angrest, whom he met in captivity, andOmri Miran, “a man of immense strength and an unbreakable spirit.” They “have been held in captivity for 18 agonizing months, over 570 days ripped away from their families, their dreams and their lives. Every second of every day, I’m reminded that we cannot truly be free while our people remain in captivity.” Siegel says that he carries “the heavy burden of knowing what those still in captivity endure every single day. I survived horrors I could never have imagined, starvation, dehydration, relentless humiliation. I witnessed sexual assault, trapped 130 feet underground in suffocating tunnels. I saw acts of medieval torture that still haunt me.” The released hostage says that Trump is responsible for his freedom, and he appeals to the US president “to continue his commitment. Apply pressure. Restart negotiations immediately and secure a deal now, before it’s too late.” Freed hostage Doron Steinbrecher, who was kidnapped from Kibbutz Kfar Aza and released in January, says that it “was clear that the release of myself and my fellow hostages happened thanks to the election of President Trump, thanks to his immense efforts and the efforts of his team.” Steinbrecher recounts her time in captivity, “spent underground, trapped in the dark, suffocating tunnels with no daylight, no sense of time, no insurance I would survive another day.” She says she is grateful for her freedom, “but my heart is heavy, because 59 hostages remain in captivity, 59 families trapped in [an] endless cycle of hope and despair.” She appeals to Trump: “Please don’t stop. Continue to fight for them, just as you fought for me. Continue to be their voice, just as you gave me mine.”",
      "author": "Amy Spiro"
    },
    {
      "time": "7:00 pm",
      "headline": "MK demands AG ‘bring to justice’ protesters who blocked Haredi recruits at induction centers",
      "content": "Yisrael Beytenu MK Oded Forer demands that Attorney General Gali Baharav-Miara initiate criminal proceedings againstanti-enlistment protesterswho attempted to block Haredi recruits from entering the IDF’s induction center earlier today. In a letter, Forer urges Baharav-Miara to “take action to bring to justice the rioters who are inciting evasion of IDF service.” Forer notes that the Israeli penal code states “clearly and unequivocally” that those guilty of inciting evasion are subject to five years’ imprisonment, rising to 15 years during wartime, and argues that today’s coordinated multi-location protest “directly and substantially harms the security of the state, the strength of Israeli society, and the fundamental value of the equality of the burden.” It is “impossible” that IDF conscripts “would be so blatantly harmed, while the law enforcement system does not bring the perpetrators to justice,” he continues — adding that silence sends “a dangerous message of leniency toward perpetrators, and would actually encourage draft dodgers.” In a statement, Forer also calls on National Security Minister Itamar Ben Gvir to “stop talking and start acting” to protect IDF recruits. Weeks ago, Yisrael Beytenu party chairman Avigdor Liberman called on police to enforce laws prohibiting the encouragement of draft evasion againstsenior leaders in theHaredi community.",
      "author": "Sam Sokol"
    },
    {
      "time": "6:35 pm",
      "headline": "Freed hostage Omer Shem Tov says Trump was ‘sent by God’ to save captives, begs him to ‘do it again’",
      "content": "A group of freed hostages hold a press conference in English to speak about their experiences in captivity and to beg for US President Donald Trump to push for the release of those still held hostage. Freed hostage Omer Shem Tov recounts spending 505 days in Gaza “without freedom, without sunlight, with very little food and water, without basic necessities.” He lived, he says, “every moment in fear.” Shem Tov says that when he met Trump in the White House earlier this year, “I told him then, and I believe it with all my heart — he was sent by God to help save us. Because of his leadership, because he made hostages a real priority, I was able to come home to my family.” The released captive appeals to the US president “to do it again. Use every tool, with everything you have, bring the rest back. Every day matters. every life matters. Even for those of us who made it home, the feeling can never be complete while others are still left behind.” Naama Levy, an IDF observation soldier who was kidnapped on October 7 from the Nahal Oz IDF base and freed in January, says at the press conference that she was not treated as a “human being” while in captivity. Levy recounts watching her friends and comrades be “brutally murdered before my very eyes” before she was “dragged violently as the entire world watched, thrown into the back of a terrorist jeep, treated not as a human being, but as trophy.”  The freed captive recounts meeting Trump in the White House, praising him for achieving “what many thought was impossible.” “We the survivors, know you are a decisive and irreplaceable force saving lives,” says Levy. “There is no greater achievement, but the work is not yet done.”",
      "author": "Amy Spiro"
    },
    {
      "time": "6:22 pm",
      "headline": "Katz: If Israel needs to act against Iran, ‘we know there are those who will’ carry out its decisions",
      "content": "Defense Minister Israel Katz says Israel will not allow Iran to obtain nuclear weapons, warning that the military will act if necessary. “We will not allow Iran nuclear weapons. We will need to make decisions, and we know there are those who will carry them out if we have to act,” Katz says during a meeting today with the IDF General Staff Forum.",
      "author": "Emanuel Fabian"
    },
    {
      "time": "6:05 pm",
      "headline": "Smotrich condemns raucous Haredi protests outside IDF induction bases",
      "content": "Finance Minister Bezalel Smotrich condemns today’santi-draft demonstrationsoutside several IDF bases, in which protesters attempted to prevent the induction of conscripts entering the IDF’s new ultra-Orthodox brigade. “At this time, when the entire nation of Israel is mobilized for its security, I want to send great encouragement to the ultra-Orthodox, Torah true, God-fearing recruits who choose to shoulder the sacred responsibility of defending the people and the land,” he tweets. “I strongly condemn the attack on them at the hands of a group of violent savages. Law enforcement authorities must seize the rioters and bring them to justice.”",
      "author": "Sam Sokol"
    },
    {
      "time": "5:55 pm",
      "headline": "Turkish Airlines, Pegasus forgo their slots at Ben Gurion Airport",
      "content": "Turkey’s airlines have decided to waive their time slots at Tel Aviv’s Ben Gurion Airport, indicating that they will not resume their flight services to Israel in the foreseeable future. Both Turkish Airlines and Pegasus Airlines halted flights to Israel until further notice after war broke out with the Hamas terror group in Gaza in the aftermath of the October 7, 2023, onslaught. Turkish was the fourth-largest carrier at Ben Gurion Airport in 2023. During the suspension period, Turkish and Pegasus held onto their flight slots at Tel Aviv’s Ben Gurion Airport, keeping their options open to resume their services to Israel. Flight slots are permissions granted by the airport authority for an airline to land and take off on a particular day and within a specific time frame. It also grants the airline access to airport services and infrastructure. The move by Turkey’s airlines comes as UK carrier Virgin Atlanticdecided to ceasethe operation of direct flights between London and Tel Aviv, after postponing the resumption of the route several times over the past 18 months.",
      "author": "Sharon Wrobel"
    },
    {
      "time": "5:29 pm",
      "headline": "Netanyahu in court: Sara would ‘look like a sumo wrestler’ if she drank 160 cases of champagne",
      "content": "Testifying in his ongoing corruption trial, Prime Minister Benjamin Netanyahu addresses claims that he received improper gifts of champagne and cigars from Hollywood producer Arnon Milchan in exchange for pushing legislation favorable to him, known as Case 1000. “Milchan gave me cigars as a friend, I never asked him to, he would come and give them to me,” Netanyahu tells the court. The prime minister also claims that “Milchan bathed in champagne, he drank champagne with every meal, his basement was full of champagne, he would give everyone champagne, he gave it to [Shimon] Peres as well.” His wife Sara, says Netanyahu, “received a fraction of that. My wife would look like a sumo wrestler if she drank 160 cases of champagne, and I can tell you that she doesn’t weigh 300 kilograms.” He also dismissesclaims by witnessHadas Klein, who worked as an aide to Milchan, that Sara harassed and threatened Klein and tried to get her fired. “I never once saw Sara yell at her, what I saw was all ‘lovey dovey,'” the prime minister claims. Protesters at the trial shout at Netanyahu at one point that the hostages being held in Gaza “don’t have champagne and cigars.”",
      "author": "Unknown"
    },
    {
      "time": "5:15 pm",
      "headline": "IDF uses new Bar rockets for the first time during fighting in Gaza",
      "content": "The IDF says it has made its first operational use of a new artillery weapon in the Gaza Strip. The Bar rockets, developed by Elbit, were used by the 282nd Artillery Regiment to hit targets in southern Gaza amid the ongoing offensive against Hamas. According to the military, the Bar rockets feature a “navigation mechanism tailored to challenging combat environments,” and they are able to strike targets within “a very short time.” Bar rockets are set to replace the IDF’s aging Romach rockets, which are launched from M270 Multiple Launch Rocket Systems.",
      "author": "Emanuel Fabian"
    },
    {
      "time": "5:04 pm",
      "headline": "Immigration to Israel down 24% since last Independence Day",
      "content": "Ahead of Israel’s Independence Day, the Aliyah and Integration Ministry says 26,211 new immigrants have moved to Israel over the past year — 24% fewer than the 34,610 that arrived during the same period a year earlier. Among the new immigrants, 14,398 came from Russia, 3,185 came from the United States and 2,253 moved from France, the ministry says. Immigration to Israel has been on the decline since Hamas launched its war against Israel on October 7, 2023. After registering 46,590 new immigrants in 2023, immigration declined by 30% in 2024 to 32,161, despite rising antisemitism worldwide, the Aliyah and Integration Ministry says. “Even today, 77 years after the establishment of the state and in a particularly complex security period, we see the continued desire of many Jews to immigrate, even during the war, in order to be part of the Zionist story,” says Immigration and Integration Minister Ofir Sofer. “Immigrating at this time strengthens Israel’s solidarity and boosts the spirit of the people.”",
      "author": "Zev Stub"
    },
    {
      "time": "4:40 pm",
      "headline": "Qatari PM calls Gaza aid blockade immoral ‘stain’ on world, as Israel slams ICJ hearings on issue",
      "content": "Israel’s aid blockade on the Gaza Strip aims to achieve political goals at the cost of Palestinian lives, says Qatar’s Prime Minister and Foreign Minister Sheikh Mohammed bin Abdulrahman Al-Thani. “What has been happening in the Gaza Strip for more than a year and a half offers painful lessons,” says Al-Thani at the opening of the 2025 Global Security Forum in Doha. “The death of children from hunger and cold is exploited as a tool to achieve narrow political objectives, while an entire population is besieged and denied the most basic rights to receive aid, without any accountability,” he isquoted as saying in a statementshared by Qatar’s Foreign Ministry. Israel announced yesterday that it would not participate inoral proceedingsthis week at the UN’s International Court of Justice on Israel’s humanitarian obligations toward Palestinians, including the provision of aid to Gaza. Israel strictly controls all entry of aid for the 2 million-plus Palestinians in Gaza, and halted aid deliveries to the enclave on March 2 after the collapse of a ceasefire and hostage release deal. Foreign Minister Gideon Sa’ar said earlier today that Israel will not agree to cooperate with the UNRWA aid agency, claiming that it “employed over 1,400 known terrorists, many of whom took an active part in the October 7 atrocities.” Al-Thani says at the forum that “what is most painful, and a stain on the conscience of the entire world, is that food and medicine have become weapons in this war.” Yesterday, the Qatari leader said he saw “a bit of progress compared to other meetings” regarding ceasefire negotiations last week mediated by Qatar and Egypt, adding: “We need to find an answer for the ultimate question: how to end this war. That’s the key point of the entire negotiations.”",
      "author": "Nava Freiberg"
    },
    {
      "time": "4:23 pm",
      "headline": "Iran port explosion caused by ‘negligence,’ says interior minister",
      "content": "Iran’s Interior Minister Eskandar Momeni says that a deadly explosion at the country’s largest commercial port two days ago was caused by “negligence” and failure to comply with safety measures. “Some culprits have been identified and summoned… There were shortcomings, including incompliance with safety precautions and negligence in terms of passive defense,” Momeni tells state TV, adding that the materials should have been dispersed.",
      "author": "AFP"
    },
    {
      "time": "4:15 pm",
      "headline": "Four teens convicted in Sweden over shooting attack on Israeli defense firm Elbit",
      "content": "A Swedish court sentences four teenagers to prison for their involvement in a shooting that targeted an Israeli military technology firm last year. A 13-year-old boy opened fire on the entrance to an office of Elbit Systems in the city of Gothenburg in southwestern Sweden on October 10, 2024. He was arrested shortly after but was not charged since he was below Sweden’s age of criminal responsibility of 15. No one was injured in the shooting. However, the Gothenburg district court sentences four others today for their roles in recruiting the young boy, supplying the gun and organizing the shooting. One 19-year-old was handed a five-year prison sentence for “involving a minor in a crime,” as well as aiding a weapons offense and aiding an unlawful threat. Another 19-year-old was also given a five-year sentence, and a third was given four years and 11 months. A 15-year-old boy was sentenced to a year and eight months of juvenile detention. According to the prosecution, the identity of the mastermind of the shooting is still unknown, the court says in its ruling.",
      "author": "AFP"
    },
    {
      "time": "4:07 pm",
      "headline": "UK’s Starmer to host Palestinian Authority PM in London with pledge to advance statehood",
      "content": "British Prime Minister Keir Starmer and Foreign Secretary David Lammy are slated to host Palestinian Authority Prime Minister Mohammad Mustafa in London today, and will sign a memorandum of understanding “enshrining their commitment to advancing Palestinian statehood as part of a two-state solution,” says the Foreign Office. The MOU will also “stress that the Palestinian Authority is the only legitimate governing entity in the Occupied Palestinian Territories, and underlines the importance of reunifying Gaza and the West Bank under its authority.” Israel rejects handing Gaza over to the PA. Last night, Prime Minister Benjamin Netanyahuindicated in a speechthat the PA isn’t any better than Hamas — both want to destroy Israel, but the PA is currently using lawfare rather than military means, he said. In London today, the two sides will agree on a “coordinated approach” to Gaza’s future, says the statement, based on Arab initiatives. “The UK will make clear that Hamas must immediately release the hostages and relinquish control of Gaza.” London will announce a £101 million (NIS 490 million) relief package for economic development and for support of PA governance and reform. According to the Foreign Office, the visit “reflects the UK’s steadfast support for the Palestinian Authority and the Palestinian people at a critical juncture in the Occupied Palestinian Territories, and desire to further strengthen bilateral relations.” “The UK is clear that there can be no role for Hamas in the future of Gaza and we are committed to working with the Palestinian Authority as the only legitimate governing entity in the Occupied Palestinian Territories,” says Foreign Secretary David Lammy. “We will not give up on the two-state solution, with a Palestinian state and Israel living side-by-side in peace, dignity and security. I reaffirm the UK’s commitment to recognizing a Palestinian state as a contribution to that process, at a time that has the greatest impact.”",
      "author": "Lazar Berman"
    },
    {
      "time": "4:02 pm",
      "headline": "Official: Israel won’t accept 5-year Gaza truce, Qatar not helping hostage talks of late",
      "content": "An Israeli official says that the Qataris have “recently had an influence that was not positive on negotiations” to free hostages from Gaza. An Arab officialyesterday denied Hebrew media reportsthat Qatar had urged Hamas to reject a recent Egyptian proposal for a hostage-ceasefire deal amid the terror group’s ongoing war with Israel in the Gaza Strip. The source claimed that the reports are being “manufactured” by Israeli officials seeking to deflect blame for the failure of the talks away from Prime Minister Benjamin Netanyahu. The official says there is “no chance” Israel will agree to the five-year ceasefire plan that Arab mediators are discussing. “There is no chance that we will agree to ahudnawith Hamas that just allows it to rearm, recover and to continue its war against Israel.” Turning to Israel’s support of US President Donald Trump’s plan to relocate Palestinians from Gaza, the official says that “emigration is still not happening in large numbers. We have appeals from Western countries that want to bring their citizens out. Canada turned to us and said it has family members it wants to bring to Canada.” Israel will let out anyone who wants to leave of their own volition, says the official, adding that there are countries willing to accept them. Israel’s campaign in Gaza is still designed to slowly pressure Hamas in order to push it to accept Israel’s terms for a hostage deal, says the official, “but our patience isn’t endless.” Speaking to reporters, the official also defends the Foreign Ministry campaign to have the Bank of Israel cancel NIS 200 banknotes in order to harm Hamas finances. “Israel’s duty, when fighting Hamas, is to take all possible means to collapse the economic system, and this system is based on this money,” says the official. “Hamas is at a point of economic decline following the lack of aid trucks in the last two months, from which it used to make a profit,” adds the official. “This is a very serious opportunity to collapse Hamas that has not been seriously examined to date.” The Bank of Israel summarilyrejected the idealast week.",
      "author": "Lazar Berman"
    },
    {
      "time": "3:31 pm",
      "headline": "Israeli official denies Jerusalem responded insensitively to Pope Francis’s death",
      "content": "An Israeli official denies that Jerusalem responded insensitively to the death of Pope Francis last week. “There was a representative of Israel at the funeral,” says the official, referring to Israel’s envoy to the Holy See. The pontiff’s funeral on Saturday was attended by world leaders and royalty including US President Donald Trump. “The ambassadors around the world were instructed to go and sign the books of condolence at the Vatican missions,” the official continues. “In addition, there was a tweet from the president and a statement from the prime minister. We respect the feelings of Catholic believers around the world.” Shortly after the pope’s death, the Foreign Ministry erased a post on its official X account expressing sorrow over the death of the pontiff, who was a critic of Israel’s war in Gaza and was inconsistent in his statements on Jewish-Christian ties. “Rest in peace, Pope Francis. May his memory be a blessing,” read the post. It was taken down hours later.",
      "author": "Lazar Berman"
    },
    {
      "time": "3:26 pm",
      "headline": "Senior IDF officer jailed for 80 months for sex offenses for filming nude soldiers, civilians",
      "content": "A former senior IDF officer convicted of dozens of counts of sex offenses and invasion of privacy for filming his female subordinates while nude without their knowledge has been sentenced by a military court to 80 months in jail. Lt. Col. Dan Sharoni was arrested in 2021 for his actions, which included collecting sexual images of soldiers and some civilians over the course of at least eight years. He was dismissed from duty that year. Last year, a military court convicted Sharoni of 67 offenses in total: 23 counts of indecency, 39 counts of privacy violation, three counts of illegally hacking a computer, one count of attempted indecency — for a case in which he installed a hidden camera in someone’s room but ultimately only photographed them fully clothed — and one count of conduct unbecoming a soldier. After several hearings, the court sentenced Sharoni to an unprecedented six years and eight months in jail, along with a suspended sentence, and ordered to pay NIS 300,000 ($82,000) in damages to the 49 victims. Sharoni is also being demoted to the rank of private, the lowest rank in the IDF. The demotion will take effect 45 days after the end of the legal proceedings. During the sentencing hearing, “the military court emphasized the severity of the defendant’s actions, who exploited his authority and power and violated the trust placed in him as a commander,” the IDF says. “The military court highlighted the serious harm caused by the defendant’s actions to the image of commanders in the IDF and to the military system as a whole. The court stressed the need to denounce such behavior and the duty to protect the security of all service members,” the military adds.",
      "author": "Emanuel Fabian"
    },
    {
      "time": "3:21 pm",
      "headline": "Virgin Atlantic says it’s ceasing London-Tel Aviv flights",
      "content": "UK carrier Virgin Atlantic decides to cease the operation of direct flights between London and Tel Aviv, after postponing the resumption of the route several times following the outbreak of war with the Hamas terror group. “After careful consideration, we have taken the difficult decision to cancel our services between London Heathrow and Tel Aviv,” Virgin states in a travel update.​ “We will continue to serve Tel Aviv as the only UK airline to have a partnership with EL AL, Israel’s national carrier, on services between Tel Aviv Ben Gurion and London Heathrow.” The UK carrier adds that the codeshare agreement with EL AL will offer passengers “connections between Israel, the UK and the US, specifically to Las Vegas, Miami, New York and Atlanta.” Travelers who have booked tickets will be entitled to a refund or can be rebooked on flight services operated by EL AL, the carrier says. Virgin was expected to resume its flight services to Tel Aviv from London Heathrow around November after halting the service due to the outbreak of the war against Hamas in Gaza following the October 7, 2023, onslaught.",
      "author": "Sharon Wrobel"
    },
    {
      "time": "3:12 pm",
      "headline": "Army chief slams Haredi anti-draft protesters: ‘In a multifront war, the IDF needs everyone’",
      "content": "IDF Chief of Staff Lt. Gen. Eyal Zamir condemns the clashes that broke out at recruitment offices earlier today during the enlistment of Haredi men. Ultra-Orthodox protesters blocked roads and harassed conscripts who arrived at the induction centers today. “At the start of a week that symbolizes the memory of Israel’s fallen soldiers and the importance of our independence as one united people, I view the actions of a group of extremists with great severity,” Zamir says. He emphasizes that the IDF values the enlistment of Haredi recruits and is preparing to integrate them in a way that respects the unique needs of their community. “In the midst of a multifront war, the IDF needs everyone, and we will continue to work toward this goal,” Zamir adds.",
      "author": "Stav Levaton"
    },
    {
      "time": "3:04 pm",
      "headline": "Conclave to elect new pope to begin meeting on May 7, Vatican announces",
      "content": "Catholic cardinals will meet on May 7 to start voting for a new pope, the Vatican announces, a week after the death of Pope Francis. So-called “Princes of the Church” under the age of 80 will meet in the Sistine Chapel to choose a new religious leader of the world’s 1.4 billion Catholics. The date was decided at meeting of cardinals of all ages, two days after the funeral of Francis, who died on April 21 aged 88. The Church’s 252 cardinals were called back to Rome after the Argentine’s death, although only 135 are eligible to vote in the conclave. They hail from all corners of the globe and many of them do not know each other. But they already had four meetings last week, so-called “general congregations,” where they began to get better acquainted. The Vatican closed the Sistine Chapel, where voting will take place under Michelangelo’s 16th-century ceiling frescoes, to begin preparations. So far there are few clues as to whom cardinals might choose.",
      "author": "AFP"
    },
    {
      "time": "2:56 pm",
      "headline": "Israeli official: US, Israel in close and open contact over Iran’s nuclear program",
      "content": "Israel and the US are in close, open contact over Iran’s nuclear program, says an Israeli official. “We have a dialogue with the Americans, the dialogue is not one-sided and we also express positions,” says the official. “There is an ongoing dialogue on many levels. I would urge you to avoid premature conclusions. There is a good, intimate relationship between the governments.” The official points to US Special Envoy Steve Witkoff’s April 15 statements about dismantling Iran’s weaponization and enrichment programs, and US Secretary of State Marco Rubio’s insistence last week that Iran could have a civilian nuclear program, but only with enrichment outside of Iran. The US and Iran have so far concluded three rounds of nuclear talks, and are slated to continue discussions on Saturday. “I am convinced that the United States is committed to preventing nuclear weapons from Iran,” stresses the official. The official adds that “we don’t know of any [Israeli] connection” to the deadly explosion at the Bandar Abbas port in Iran on Saturday. Turning to Syria, the official says that Israel “is not interested in Syria becoming a Turkish protectorate.” “At the same time, we have no interest in friction with Iran on Syrian soil,” the official continues. “Therefore there is dialogue.”",
      "author": "Lazar Berman"
    },
    {
      "time": "2:43 pm",
      "headline": "Large swaths of Spain and Portugal hit by power outage",
      "content": "Spanish power grid operator Red Electrica says it is working with energy companies to restore power after large parts of Spain and Portugal are hit by a power outage. Spanish radio stations say part of the Madrid underground is being evacuated. There are traffic jams at Madrid city center as traffic lights stopped working, Cader Ser Radio station reports. E-Redes, a Spanish electricity grid monitoring company, says in a statement it is working on reestablishing connection in phases. “This is a wider European problem,” it adds.",
      "author": "Reuters"
    },
    {
      "time": "2:42 pm",
      "headline": "Putin announces 3-day ceasefire in Ukraine war to coincide with WWII commemorations in May",
      "content": "Russian President Vladimir Putin has ordered a surprise three-day temporary ceasefire on  May 8-10, coinciding with Moscow’s World War II Victory Day commemorations, the Kremlin says. “Russia believes that the Ukrainian side should follow this example. In the event of violations of the truce by the Ukrainian side, the Russian armed forces will give an adequate and effective response,” the Kremlin says. It comes as US President Donald Trump scales up efforts to broker a peace deal in Ukraine.",
      "author": "Agencies"
    },
    {
      "time": "2:40 pm",
      "headline": "Lands Authority vows to underwrite rehab of Gibton Springs Nature Reserve damaged by wildfire",
      "content": "The Israel Lands Authority vows to underwrite the rehabilitation of some 215 dunams (62 acres) of land in the Gibton Springs Nature Reserve in central Israel that was severely damaged by wildfire last week. Located in the heart of the southern coastal plain, and known for its rare humid habitat, its biological richness, and its ecological importance, the reserve had only reopened just over two years ago after a decade of work to rid the site of pollution and restore the water regimen, natural vegetation and animal species. The Israel Nature and Parks Authority says the fire has left “a huge ecological and scenic void.” Yanki Quint, director of the Israel Lands Authority and chairman of the Open Spaces Preservation Fund, says: “Just as at the beginning of the year, the Open Spaces Preservation Fund approved approximately NIS 150 million ($41.3 million) to restore nature reserves and open spaces damaged during the war, so we will act to restore the Gibton Springs Nature Reserve.”",
      "author": "Sue Surkes"
    },
    {
      "time": "2:38 pm",
      "headline": "Alon Ohel’s family details his injuries, calls for wounded hostages to get medical care outside Gaza",
      "content": "The family of hostageAlon Oheldetails his injuries and proposes a plan that would see wounded captives transferred by Hamas to neutral countries for medical care. Ohel’s parents say their son is suffering life-threatening injuries and is on the brink of becoming blind. “He lost his sight in one eye and we know that the other can be saved. He suffers from a serious head injury and shrapnel in his body,” the family says. “We heard these descriptions from someone who was with him in Hamas captivity.” “Alon was kidnapped from the‘bunker of death,’after dozens of grenades were thrown into the shelter, and he was injured by those grenades,” the family says. “He received disgraceful treatment from Hamas. A 19-year-old boy stitched him up with a needle and thread.” “We don’t sleep at night knowing that there are aid organizations sent by many Western countries that are providing treatment to Gazans. What country provides medical treatment to one side, knowing that there are hostages with life-threatening injuries who are not receiving medical treatment?” says father Kobi Ohel. The family proposes a plan to allow wounded hostages to receive medical care. Under the proposal, wounded hostages would be taken for medical treatment at an American hospital in a Gulf country, or at a European hospital. Medical and humanitarian aid would be resumed to the Gaza Strip for the duration of the medical treatment. Under the plan, after a period of up to 72 days, the wounded will return to Israel when a comprehensive deal is signed that sees the release of all the hostages. In February, Idit Ohel said that released hostages Eli Sharabi and Or Levy were held with her son for the duration of their captivity. Their return from Gaza in February was the first time that Ohel’s family received confirmation that he is still alive since he was abducted from the Nova music festival on October 7, 2023.",
      "author": "Unknown"
    },
    {
      "time": "1:38 pm",
      "headline": "27 killed in Israeli strikes on Gaza, Hamas-controlled authorities say",
      "content": "Israeli strikes on the Gaza Strip overnight and into today killed at least 27 Palestinians, according to local health officials from Hamas-controlled authorities. There is no comment from the Israeli military. The figures cannot be independently verified and do not differentiate between civilians and combatants. Israel has said it seeks to minimize civilian fatalities and stresses that Hamas uses Gaza’s civilians as human shields, fighting from civilian areas including homes, hospitals, schools, and mosques. Palestinian civilians say nowhere in Gaza is safe.",
      "author": "AgenciesandToI Staff"
    },
    {
      "time": "1:38 pm",
      "headline": "Death toll from Iran port blast reaches 46",
      "content": "The death toll from a massive explosion at Iran’s largest commercial port has risen to 46, state media reports, adding that most of the more than 1,000 wounded have been discharged from hospitals. “The death toll in the Shahid Rajaee Port fire has reached 46,” the official IRNA news agency reported, quoting Mehrdad Hassanzadeh, the crisis management director at the Hormozgan governorate. He adds that only “138 wounded are still in hospital,” while the rest have been discharged.",
      "author": "AFP"
    },
    {
      "time": "1:20 pm",
      "headline": "Palestinian envoy to ICJ: Israel targeting and blocking humanitarian organizations",
      "content": "A Palestinian diplomat tells the United Nations’ top court that Israel is killing and displacing civilians and targeting aid workers in Gaza, in a case that Israel has criticized as “systematic persecution and delegitimization.” Israel denies deliberately targeting civilians and aid staff as part of its war against Hamas, sparked by the terror group’s October 7 onslaught, and is not attending the hearing at the International Court of Justice. Palestinian envoy to the Netherlands Ammar Hijazi accuses Israel of breaching international law in Gaza and the West Bank. “Israel is starving, killing and displacing Palestinians while also targeting and blocking humanitarian organizations trying to save their lives,” he charges. Earlier this morning, Foreign Minister Gideon Sa’arcalledUNRWA “an organization infiltrated beyond repair by terrorism.” The UN has asked judges at The Hague to clarify in this week’s proceedings Israel’s legal obligations toward the UN and its agencies, international organizations or third-party states to “ensure and facilitate the unhindered provision of urgently needed supplies essential to the survival of the Palestinian civilian population.” Israel strictly controls all inflows of international aid for the 2.4 million Palestinians in the Gaza Strip. It halted aid deliveries to Gaza on March 2 after the collapse of a ceasefire and hostage release deal. Israel has said it seeks to minimize civilian fatalities and stresses that Hamas uses Gaza’s civilians as human shields, fighting from civilian areas including homes, hospitals, schools, and mosques.",
      "author": "AgenciesandToI Staff"
    },
    {
      "time": "1:01 pm",
      "headline": "Houthis say death toll reaches at least 68 in US strike on Yemen detention center for African migrants",
      "content": "Houthi rebel-controlled media in Yemen says that US strikes targeted a migrant detention center in the movement’s stronghold of Saada, killing at least 68 people. The US military has hit the Iran-backed Houthis with near-daily strikes since March 15 in an operation dubbed “Rough Rider,” seeking to end the threat they pose to vessels in the Red Sea and Gulf of Aden. The Houthis have been launching strikes targeting Israel and Western vessels in the Red Sea, in what they describe as solidarity with the Palestinians, since Hamas conducted the worst-ever attack on Israel in October 2023. Yesterday, the US military said it has hit more than 800 targets in Yemen since mid-March, killing hundreds of Houthi rebels including members of the group’s leadership. “The civil defense has announced that 68 African migrants were killed and 47 others wounded in the US attack targeting a center for illegal migrants in the city of Saada,” the Houthis’ Al-Masirah TV said. AFP could not independently confirm the veracity of Al-Masirah’s claim that the strikes had hit a migrant detention center, or the toll. AFP has contacted the US military for comment. According to a statement cited by Al-Masirah from the Houthi administration’s interior ministry, the center housed “115 migrants, all from Africa.” The broadcaster showed footage of bodies stuck under the rubble and of rescuers working to help the casualties. Each year, tens of thousands of migrants brave the Eastern Route from the Horn of Africa, seeking to escape conflict, natural disasters and poor economic prospects by sailing across the Red Sea toward the oil-rich Gulf. Many hope for employment as laborers or domestic workers in Saudi Arabia and other Gulf Arab countries, though they face a perilous journey through war-torn Yemen.",
      "author": "AFP"
    },
    {
      "time": "12:37 pm",
      "headline": "Flags with black ribbons placed on graves of fallen security personnel ahead of Memorial Day",
      "content": "Military officials across the country place 25,420 miniature flags at half-staff adorned with black ribbons and the word “Yizkor,” or remembrance, on the graves of soldiers, police officers and other security personnel, as the state prepares to mark Memorial Day from sundown tomorrow. During the ceremony, IDF Chief of Staff Lt. Gen. Eyal Zamir addresses bereaved families, stating, “The Land of Israel preserves the memory of its fallen throughout its length and breadth; in the expanses where they grew up, along the trails they walked, and in the places they defended with their lives.” “When we look today at each headstone and grave, we will remember that alongside the pain of their loss, there is also pride in the independence of our nation,” he adds. Israel will come to a standstill Tuesday evening at 8 p.m. for a minute-long memorial siren to commemorate the country’s fallen soldiers and terror victims. The siren will be followed by the lighting of a memorial flame for the fallen at the Western Wall, the site of the official state commemoration ceremony. Memorial services will be held across the country. On Wednesday, a two-minute siren will sound at 11 a.m. to mark the start of ceremonies at cemeteries nationwide. Later in the day, another official ceremony will take place at Mount Herzl military cemetery in Jerusalem between 7 and 8 p.m., marking the end of Memorial Day and the beginning of Independence Day.",
      "author": "Stav Levaton"
    },
    {
      "time": "12:25 pm",
      "headline": "Woman’s body found buried in yard near Hadera home; man arrested, said to be victim’s brother",
      "content": "A woman’s body was found buried in the yard near a Hadera home, Hebrew-language media reports. Police say they are investigating the incident and arrested a male relative of the victim on suspicion of involvement in her death. Reports say the detained man is the victim’s brother. The Ynet news site says the suspect had threatened the victim in the past and that a restraining order had been issued when he broke into her home. It is unclear if the order is still in effect. According to the outlet, the woman’s body was found when a friend was unable to contact her since yesterday and went to the house. Paramedics say they declared the victim, in her late 40s, dead at the scene.",
      "author": "Charlie Summers"
    },
    {
      "time": "12:17 pm",
      "headline": "As ICJ holds hearings on aid for Palestinians, Sa’ar says Israel-UNRWA cooperation ‘won’t happen’",
      "content": "Foreign Minister Gideon Sa’ar lays out accusations against the United Nations and the organization’s Relief and Work Agency, at a press conference taking place as the UN’s International Court of Justice opens a week ofhearingson Israel’s humanitarian obligations toward Palestinians. “At this very moment, the ICJ is beginning the deliberations in another shameful proceeding against Israel,” says the foreign minister, adding that Israel chose not to attend the oral proceedings so as “not to take part in this circus.” “It is not Israel that should be on trial,” says Sa’ar, but rather the UN and UNRWA, the latter of which coordinates nearly all aid to Gaza. Sa’ar calls UNRWA “an organization infiltrated beyond repair by terrorism.” The foreign minister criticizes past rulings of the ICJ, noting that “this is the fourth proceeding relating to Israel in the court since the October 7 massacre.” “Now, they are abusing the courts, once again, to try and force Israel to cooperate with an organization that is infested with Hamas terrorists, and it won’t happen,” says the foreign minister. “UNRWA employed over 1,400 known terrorists, many of whom took an active part in the October 7 atrocities,” continues Sa’ar, citing UNRWA employeeMohammed Abu Itiwi, a Hamas Nukhba Force commander, as one example. “[Abu Itiwi] was caught on video participating in the murder and kidnapping of Israelis near Kibbutz Re’im [on October 7, 2023], including Hersh Goldberg-Polin,” who was taken hostage and then murdered in captivity, says Sa’ar. “I accuse,” says Sa’ar, “I accuse UNRWA. I accuse the UN. I accuse the Secretary General, I accuse all those that weaponize international law and its institutions in order to deprive the most attacked country in the world, Israel, of its most basic right to defend itself.” Behind Sa’ar, a large screen displays the faces of UN Secretary-General António Guterres and UNRWA Commissioner-General Philippe Lazzarini, alongside the bold headline “J’Accuse” (“I Accuse” in French), referencing an 1898 open letter written by French author Émile Zola during the Dreyfus Affair. The UN has asked judges to clarify in this week’s proceedings Israel’s legal obligations toward the UN and its agencies, international organizations or third-party states to “ensure and facilitate the unhindered provision of urgently needed supplies essential to the survival of the Palestinian civilian population.” Israel strictly controls all inflows of international aid for the 2.4 million Palestinians in the Gaza Strip. It halted aid deliveries to Gaza on March 2 after the collapse of a ceasefire and hostage release deal. The war in Gaza was sparked by the October 7, 2023, Hamas invasion and massacre in southern Israel, in which some 1,200 people were killed and 251 were seized as hostages. Agencies contributed to this report.",
      "author": "Nava Freiberg"
    },
    {
      "time": "11:44 am",
      "headline": "Netanyahu set to visit Azerbaijan on May 8 to meet president, Jewish community",
      "content": "Prime Minister Benjamin Netanyahu will visit Azerbaijan on May 8, The Times of Israel has learned. He will meet with President Ilham Aliyev and members of the Jewish community. Azerbaijan is not party to the International Criminal Court in The Hague, and as such there is no danger that Netanyahu will be arrested.",
      "author": "Lazar Berman"
    },
    {
      "time": "11:20 am",
      "headline": "Magen David Adom volunteer arrested on suspicion of raping teenage girls, young woman who volunteered with him",
      "content": "A volunteer with Magen David Adom has been arrested on suspicion of raping and sexually assaulting teenage girls who also volunteer with the emergency service. Eliran Bakalo, 40, works for the Holon municipality and is suspected of carrying out the assaults over a number of years. There are at least three complainants against him — two teenage girls and one young woman. One of the teenagers is under the age of 16. According to the Ynet news site, there are also suspicions that the suspect may have used his licensed weapon to threaten one of the victims. Police are said to believe there may be other victims. Bakalo denies the accusations.",
      "author": "Unknown"
    },
    {
      "time": "11:11 am",
      "headline": "WATCH: International Court of Justice opens hearings on Israel’s aid obligations to Palestinians",
      "content": "The UN’s top court opens a week ofhearingson Israel’s humanitarian obligations toward Palestinians, more than 50 days into its blockade on aid entering war-ravaged Gaza. The hearings can be watched here:  The UN’s General Assembly approved a resolution in December asking the ICJ for an advisory opinion on the matter “on a priority basis and with the utmost urgency.” The resolution, spearheaded by Norway, was adopted by a large majority. The UN has asked judges to clarify Israel’s legal obligations toward the UN and its agencies, international organizations or third-party states to “ensure and facilitate the unhindered provision of urgently needed supplies essential to the survival of the Palestinian civilian population.” Israel strictly controls all inflows of international aid vital for the 2.4 million Palestinians in the Gaza Strip. It halted aid deliveries to Gaza on March 2 amid the collapse of a ceasefire and hostage release deal. The war in Gaza was sparked by the October 7, 2023, Hamas invasion and massacre in southern Israel, in which terrorists killed some 1,200 people and seized 251 as hostages. US President Donald TrumpsaidFriday that he told Prime Minister Benjamin Netanyahu that “we’ve got to be good to Gaza” as he pushed the Israeli premier to get more food and medicine into the Strip. The revelation of the discussion between Netanyahu and Trump came shortly after the World Food Programme said it had run out of food stocks in Gaza due to the sustained closure of crossings into the enclave.",
      "author": "ToI StaffandAgencies"
    },
    {
      "time": "11:03 am",
      "headline": "Israel launches Hebrew-language website to commemorate immigrants killed since Oct. 7",
      "content": "Ahead of Israel’s Memorial Day, the Immigration and Integration Ministry launches awebsiteto commemorate those killed on October 7, 2023, and in the ensuing war. The website presents the stories of 136 immigrant soldiers who fell in battle and immigrant civilians who were killed. Among those listed are British-born lone soldierNathanel Young, who was killed fighting terrorists on October 7, and French-Israeli citizenCeline Ben David Nagar, who was murdered on her way to the Nova music festival. The site is currently in Hebrew only, but will be translated to English and other languages in the future, the ministry says. “The goal of the commemoration project is to honor the memory of the fallen heroes, and to tell the story of immigrants who made an extraordinary contribution to the war effort,” says Immigration and Integration Minister Ofir Sofer. “This is everyday heroism that deserves national recognition.”",
      "author": "Zev Stub"
    },
    {
      "time": "10:45 am",
      "headline": "48 hours after explosion, firefighters still battling blazes at Iranian port",
      "content": "Firefighters in Iran are continuing to battle raging fires at the country’s largest commercial port, two days after a massive explosion killed at least 40 people, Iranian state TV reports. The blast took place on Saturday at Shahid Rajaee Port in Iran’s south near the strategic Strait of Hormuz, a waterway through which one-fifth of global oil output passes. It killed at least 40 people and injured more than 1,000 others, officials said, after triggering smaller explosions and fires in nearby containers. Iran’s state TV shows images of firefighters dousing the flames, and said the damage will be assessed after the fire is fully brought under control. Thick, swirling plumes of smoke rose over the stacked containers at the site, the TV images show. It is not immediately clear what caused the explosion but the port’s customs office said it likely resulted from a fire that broke out at the hazardous and chemical materials storage depot. An individual tied to Iran’s Islamic Revolutionary Guard Corpsreportedlyconfirmed the explosion occurred in a shipment from China of a chemical used to produce missile fuel. Aerial footage shows fires still burning at Rajaei port in Bandar Abbas on Monday, the third day since a massive explosion rocked the site.pic.twitter.com/CL187ikcsX — Iran International English (@IranIntl_En)April 28, 2025",
      "author": "AFPandToI Staff"
    },
    {
      "time": "10:44 am",
      "headline": "UN nuclear watchdog technical team in Iran for talks, foreign ministry says",
      "content": "A technical team from the International Atomic Energy Agency has arrived in Iran for talks with the authorities, foreign ministry spokesperson Esmaeil Baghaei says, a few days after Iran’s foreign minister said the UN nuclear watchdog will likely join the next round of Iran-US nuclear talks. US President Donald Trumpsaidlast week he would not be dragged by Prime Minister Benjamin Netanyahu into war with Iran, but vowed Washington could “be leading the pack” if diplomacy were to fail and joint US-Israeli military action is necessary to thwart Tehran’s nuclear program. Since 2019, Iran has breached and far surpassed the 2015 deal’s limits on its uranium enrichment, producing stocks far above what the West says is necessary for a civilian energy program, and just a short technical step away from weapons-grade material. Israel is said to be deeply concerned that the US is closing in on a “bad deal” with Iran that will not meet Jerusalem’s stated essential conditions for ensuring the regime cannot attain nuclear weapons.",
      "author": "ReutersandToI Staff"
    },
    {
      "time": "10:11 am",
      "headline": "Haredi protesters block streets near military base as ultra-Orthodox conscripts draft into IDF",
      "content": "Dozens of Haredi protesters are blocking streets near the Tel Hashomer military base in an attempt to prevent ultra-Orthodox conscripts from drafting into the Israel Defense Forces. Video shows recruits being yelled at by protesters as they are escorted to the base by police officers. תיעוד: המשטרה מנסה לפנות מהכביש מוחים מול בסיס תל השומר ביום גיוס חרדיםpic.twitter.com/aoMTcWOJHw — גלצ (@GLZRadio)April 28, 2025 הזיה של ממש. כניסה של מתגייסים חרדים דרך מפגינים שמצלמים וצועקים עליהם היא לא פחות ממחדל של הצבא. בגיוסים קןדמים מצאו לזה פתרונות כמו התייצבות במקום אחר והסעה לתוך הבקו\"ם. התנהלות שגויה ובעייתית מאד.pic.twitter.com/J4bka2A1nd — שילה פריד???????? (@shilofreid)April 28, 2025 The army has stated that it is facing a manpower shortage and currently needs some 12,000 new soldiers — 7,000 of whom would be combat troops. Currently, approximately 70,000 Haredi men between the ages of 18 and 24 are eligible for military service and have not enlisted. According to the IDF’s Personnel Directorate, only 2 percent of the 10,000 ultra-Orthodox men sent conscription orders from July 2024 to March 2025 have actually joined the armed forces. In total, 1,721 Haredim have joined the army since the beginning of the current recruitment cycle last year. Prime Minister Benjamin Netanyahu’s ultra-Orthodox coalition partners are pushing for the passage of legislation enshrining military exemptions for yeshiva students and other members of the Haredi community.",
      "author": "Unknown"
    },
    {
      "time": "9:58 am",
      "headline": "Houthi rebels say 35 African migrants killed in US airstrike on Yemen prison; no comment from US",
      "content": "Yemen’s Houthi rebels allege a US airstrike hit a prison holding African migrants, killing at least 35 people. The US military has no immediate comment. The strike in Yemen’s Saada governorate, a stronghold for the Houthis, is the latest incident in the country’s decadelong war to cause the deaths of African migrants from Ethiopia and other nations who risk crossing the nation for a chance to work in neighboring Saudi Arabia. It also likely will renew questions from activists about the American campaign, known as “Operation Rough Rider,” which has been targeting the rebels as the Trump administration negotiates with their main benefactor, Iran, over Tehran’s rapidly advancing nuclear program. The US military’s Central Command, in a statement before news of the alleged strike broke, sought to defend its policy of offering no specific details of its extensive airstrike campaign.",
      "author": "AP"
    },
    {
      "time": "9:53 am",
      "headline": "Copy of Ben-Gurion’s 1948 diary revealed: ‘The state was founded. Its fate is in the hands of the security forces’",
      "content": "A an image of the handwritten diary of David Ben-Gurion from the evening of May 14, 1948, is released ahead of Israel’s Independence Day. The original of the diary has not yet been located, the Ben-Gurion Heritage Institute and the Ben-Gurion Archive say, as they reveal the image of the journal. “At four o’clock in the afternoon, Jewish independence was declared and the state was founded. Its fate is in the hands of the security forces,” he wrote. He describes the difficult situation on the ground: “Harsh news about armored columns of the Legion… they bombed Tel Aviv last night.” The copy of the diary was found in the Ben-Gurion Archives, as part of a collaboration between the Ben-Gurion Heritage Institute and the Ben-Gurion Institute for the Study of Israel and Zionism at Ben-Gurion University of the Negev. Israel’s Independence Day is set to begin Wednesday evening.",
      "author": "Unknown"
    },
    {
      "time": "9:05 am",
      "headline": "International Court of Justice to open hearings on Israel’s aid obligations to Gazans",
      "content": "The UN’s top court will open a week ofhearingson Israel’s humanitarian obligations toward Gazans, more than 50 days into its blockade on aid entering war-ravaged Gaza. United Nations representatives will start the five days of sittings at the International Court of Justice in The Hague, followed by a Palestinian submission. Another 38 countries will then address the 15-judge panel, including the United States, China, France, Russia and Saudi Arabia. The League of Arab States, the Organisation of Islamic Cooperation and the African Union will also make submissions. The UN’s General Assembly approved a resolution in December asking the ICJ for an advisory opinion on the matter “on a priority basis and with the utmost urgency.” The resolution, spearheaded by Norway, was adopted by a large majority. The UN has asked judges to clarify Israel’s legal obligations toward the UN and its agencies, international organizations or third-party states to “ensure and facilitate the unhindered provision of urgently needed supplies essential to the survival of the Palestinian civilian population.” Israel strictly controls all inflows of international aid vital for the 2.4 million Palestinians in the Gaza Strip. It halted aid deliveries to Gaza on March 2 amid the collapse of a ceasefire and hostage release deal. The war in Gaza was sparked by the October 7, 2023, Hamas invasion and massacre in southern Israel, in which some 1,200 people were killed, and 251 were seized as hostages. US President Donald TrumpsaidFriday that he told Prime Minister Benjamin Netanyahu that “we’ve got to be good to Gaza” as he pushed the Israeli premier to get more food and medicine into the Strip. The revelation of the discussion between Netanyahu and Trump came shortly after the World Food Programme said it had run out of food stocks in Gaza due to the sustained closure of crossings into the enclave.",
      "author": "AFPandToI Staff"
    },
    {
      "time": "8:25 am",
      "headline": "Iran claims to have repelled ‘one of the most extensive and complex’ cyberattacks on infrastructure",
      "content": "One of the most widespread and complex cyber attacks against Iran’s infrastructure was repelled yesterday, the semi-official Tasnim news agency quotes the head of Iran’s Infrastructure Communications Company as saying. “One of the most widespread and complex cyber attacks against the country’s infrastructure was identified and preventive measures were taken,” Behzad Akbari says according to semi-official Tasnim news agency, without giving more detail. In recent years, Iran has seen a series of cyberattacks on critical infrastructure, including its ports. Surveillance cameras in government buildings, including prisons, have also been hacked in the past. The country disconnected much of its government infrastructure from the internet after the Stuxnet computer virus — widely believed to be a joint US-Israeli creation — disrupted thousands of Iranian centrifuges in the country’s nuclear sites in the late 2000s.",
      "author": "ReutersandToI Staff"
    },
    {
      "time": "7:55 am",
      "headline": "Conflicts spur ‘unprecedented’ rise in global military spending; Israel sees steepest increase since 1967",
      "content": "Worldwide military expenditure saw its steepest rise in 2024 since the end of the Cold War, reaching $2.7 trillion as wars and rising tensions drove up spending, researchers say. Military spending rose worldwide with particularly large increases in Europe and the Middle East, according to a new report by the Stockholm International Peace Research Institute (SIPRI). Several European countries had seen “unprecedented” rises in their military spending, the report notes. In real terms, spending rose by 9.4 percent globally compared to 2023, with 2024 marking the 10th year of consecutive spending increases. More than 100 countries, including all of the 15 largest spenders, increased their military budgets last year, says the report. The main contributor to the rise in expenditure was the European region including Russia, where spending rose by 17 percent to $693 billion. Russia’s military expenditure reached $149 billion in 2024: a 38-percent increase on the previous year and a doubling since 2015. Ukraine’s military spending grew by 2.9 percent to reach $64.7 billion. Germany’s spending increased by 28 percent, reaching $88.5 billion, overtaking India as the fourth largest in the world. The world’s largest spender, the United States, increased expenditure by 5.7 percent, reaching $997 billion. That alone accounts for 37 percent of worldwide spending and 66 percent of the military spending among NATO countries. Military budgets also drastically grew in the Middle East to an estimated $243 billion, an increase of 15 percent from 2023. As Israel continued its offensive in Gaza, its military expenditure surged by 65 percent to $46.5 billion in 2024. SIPRI noted that this represented “the steepest annual increase since the Six-Day War in 1967.” In contrast, Iran’s fell by 10 percent to $7.9 billion in 2024, “despite its involvement in regional conflicts and its support for regional proxies,” the report adds. “The impact of sanctions on Iran severely limited its capacity to increase spending,” says SIPRI. The world’s second-largest spender, China, increased its military budget by 7.0 percent to an estimated $314 billion, “marking three decades of consecutive growth.” China — which has been investing in modernizing its military and expansion of cyberwarfare capabilities and nuclear arsenal — accounted for half of all military spending in Asia and Oceania.",
      "author": "AFP"
    },
    {
      "time": "7:38 am",
      "headline": "US says it won’t reveal specific details on Yemen strikes ‘to preserve operational security’",
      "content": "The US military says it will not reveal specific details about its military strikes in Yemen, citing what it called the need “to preserve operational security” while also saying the strikes had “lethal effects” on Houthi rebels. US President Donald Trump ordered the intensification of strikes on Yemen last month, with his administration saying it will continue assaulting Iran-backed Houthi rebels until they stop attacking Red Sea shipping. Recent US strikes have killed dozens, including 74 at an oil terminal in mid-April in what was the deadliest strike in Yemen under Trump so far, according to the Houthi-run health ministry. “To preserve operational security, we have intentionally limited disclosing details of our ongoing or future operations. We are very deliberate in our operational approach, but will not reveal specifics about what we’ve done or what we will do,” the US Central Command says in a statement. The military says it has struck over 800 targets since mid-March that it says killed hundreds of Houthi fighters and numerous Houthi leaders as well as destroyed the militant group’s facilities.",
      "author": "Reuters"
    },
    {
      "time": "5:23 am",
      "headline": "NYPD investigating clashes outside synagogue between anti-Israel demonstrators, Jewish counter-protesters",
      "content": "New York City Mayor Eric Adams says the NYPD is investigating clashes between anti-Israel demonstrators and counter-protesters outside the Chabad-Lubavitch world headquarters in Brooklyn. The incidents took place on Thursday when anti-Israel demonstrators gathered outside the synagogue at 770 Eastern Parkway in Crown Heights to rally against an unannounced visit by Israel’s far-right National Security Minister Itamar Ben Gvir. The synagogue is a revered site for the Chabad movement and is located in the heart of the community. Neighborhood organizers said the protesters chanted for the removal of “Zionists” and called for an intifada. The demonstration in the Jewish neighborhood provoked widespread outrage. Anti-Israel protesters often hold vitriolic protests around the city but demonstrations at synagogues and in Jewish neighborhoods are rare. Footage later emerged showing a group of Jews following an individual down a street, shouting at them and chanting “Death to Arabs” in Hebrew. Anti-Israel activists claimed that they had been assaulted. This is a truly disgusting and shameful scene, in which hundreds of men (many supporters of Ben Gvir) were physically attacking a single woman and a New York police officer protecting her, violently throwing objects at her and chanting “death to Arabs.” Of course, what the…pic.twitter.com/KySChYFMD1 — Ahmed Fouad Alkhatib (@afalkhatib)April 27, 2025 Adams says in a statement that the protesters “surrounded the Chabad Lubavitch World Headquarters — a Jewish house of worship.” “Initial reports indicate that one female protester was isolated from her group, harassed by counter-protesters, and suffered injuries,” Adams says on X. “In another incident, a second woman was subjected to vile threatening by counter-protesters.” The statement says the “NYPD is investigating these incidents” and calls on the women involved, and any others with information, to contact the NYPD. “None of this is acceptable. In fact, it is despicable,” Adams says. “We will not tolerate violence, trespassing, menacing, or threatening. Hate has no place in our city.”",
      "author": "Luke Tress"
    },
    {
      "time": "4:55 am",
      "headline": "Reform Synagogue of Netanya vandalized last week on eve of Holocaust Remembrance Day",
      "content": "A Reform Judaism synagogue of Netanya was vandalized with anti-Reform Judaism graffiti last week, on the eve of Holocaust Remembrance Day, Ynet reports. Citing the Reform Movement of Netanya, it says that the words “fuck Reform” were scrawled on one of the walls. Stickers that had been placed on the walls in support of the Gaza hostages were ripped down, along with Israeli flags. A police complaint was filed over the incident, the report adds.",
      "author": "Unknown"
    },
    {
      "time": "4:06 am",
      "headline": "North Korea confirms for first time that it sent troops to assist Russia in its war against Ukraine",
      "content": "North Korea confirms for the first time that it sent troops to Russia to support its war against Ukraine. US, South Korean and Ukrainian intelligence officials have said North Korea dispatched about 10,000-12,000 troops to Russia last fall. But North Korea hadn’t confirmed or denied its reported troop deployments to Russia until today. Leader Kim Jong Un decided to send combat troops to Russia under a mutual defense treaty, the Central Military Commission of the ruling Workers’ Party says in a statement. It cites Kim as saying the deployment was meant to “annihilate and wipe out the Ukrainian neo-Nazi occupiers and liberate the Kursk area in cooperation with the Russian armed forces.” “They who fought for justice are all heroes and representatives of the honor of the motherland,” Kim said, according to the statement sent to state media. In March, South Korea’s military said North Korea sent about 3,000 additional troops to Russia earlier this year, after its soldiers deployed on the Russian-Ukraine fronts suffered heavy casualties. South Korea’s Joint Chiefs assessed that around 4,000 North Korean soldiers had been killed or wounded. Ukrainian President Volodymyr Zelensky earlier put the number of killed or wounded North Koreans at 4,000, though US estimates were lower at around 1,200.",
      "author": "AP"
    },
    {
      "time": "2:08 am",
      "headline": "Netanyahu says Israel stopped Iranian aircraft from reaching Syria in the days leading up to fall of Assad",
      "content": "Israeli warplanes last year intercepted Iranian aircraft headed toward Syria, preventing them from delivering troops meant to assist the country’s embattled president at the time, Bashar al-Assad, Prime Minister Benjamin Netanyahu says. The remarks in a speech give a new glimpse into Israel’s thinking in the final days in power for Assad, a longtime enemy who was overthrown by Islamist-led insurgents last December. Speaking to a conference hosted by the Jewish News Syndicate, Netanyahu claims that arch-rival Iran wanted to save Assad after watching the Iranian-backed Hezbollah terror group in neighboring Lebanon suffer heavy losses in fighting with Israel. “They had to rescue Assad,” Netanyahu says, claiming that Iran wanted to send “one or two airborne divisions” to help the Syrian leader. “We stopped that. We sent some F-16s to some Iranian planes that were making some routes to Damascus,” he says. “They turned back.” He gives no further details.",
      "author": "AP"
    },
    {
      "time": "1:13 am",
      "headline": "US says more than 800 targets in Yemen hit since mid-March, hundreds of Houthi fighters killed",
      "content": "The United States has hit more than 800 targets in Yemen since mid-March, killing hundreds of Houthi rebel fighters, including members of the group’s leadership, the US military says. Washington’s forces have hammered the Iran-backed Houthi rebels with near-daily air strikes since March 15 in an operation dubbed “Rough Rider,” seeking to end the threat they pose to vessels in the Red Sea and Gulf of Aden and reestablish US regional “deterrence.” “Since the start of Operation Rough Rider, USCENTCOM has struck over 800 targets. These strikes have killed hundreds of Huthi fighters and numerous Houthi leaders,” the military command responsible for the Middle East says in a statement. “The strikes have destroyed multiple command-and-control facilities, air defense systems, advanced weapons manufacturing facilities, and advanced weapons storage locations,” CENTCOM says. Despite the strikes, the Houthis — who control large swaths of Yemen and have been at war with a Saudi-led coalition backing the internationally recognized government since 2015 — have continued to claim attacks against both US vessels and Israel. CENTCOM says that “while the Houthis have continued to attack our vessels, our operations have degraded the pace and effectiveness of their attacks. Ballistic missile launches have dropped by 69 percent. Additionally, attacks from one-way attack drones have decreased by 55 percent.” “Iran undoubtedly continues to provide support to the Houthis. The Houthis can only continue to attack our forces with the backing of the Iranian regime,” the military command says. “We will continue to ratchet up the pressure until the objective is met, which remains the restoration of freedom of navigation and American deterrence in the region,” it adds.",
      "author": "AFP"
    },
    {
      "time": "12:35 am",
      "headline": "Houthi media reports eight killed in US strikes on Yemeni capital",
      "content": "The Houthi-affiliated Al Masirah television network reports that US strikes on the Yemeni capital Sanaa have killed at least eight people and wounded others. “Eight martyrs, including children and women… as a preliminary toll of the American aggression on the Thaqban area in Bani Al-Har Directorate” in the north of Sanaa, the station reports.",
      "author": "AFP"
    }
  ]
}