{
  "title": "Trump touts immigration crackdown despite concerns about due process",
  "url": "https://www.reuters.com/world/us/trump-sign-order-requiring-list-sanctuary-cities-states-wsj-reports-2025-04-28/",
  "publication_datetime": "2025-04-29T00:56:04Z",
  "publication_display": "April 29, 2025 | 12:56 AM UTC | Updated  ago",
  "image_url": "https://www.reuters.com/resizer/v2/GXUPIHI7DVLWLHLISQVIW25BGA.jpg?auth=ec29f42a57cffce5d709e31beffa2d0ef3a5e1979130e9b5557f914a9ed77a87&height=1005&width=1920&quality=80&smart=true",
  "summary": [
    "Summary",
    "Administration to identify non-compliant cities and states within a month",
    "Photos of alleged offenders appear on White House lawn",
    "Big drop in arrests at US-Mexican border"
  ],
  "content": "WASHINGTON, April 28 (Reuters) - U.S. PresidentDonald Trump'sadministration touted the early results of hisimmigrationcrackdown on Monday despite concerns over due process, as Trump acted to take further steps while photos of alleged criminal offenders were displayed on the White House lawn.\nTrump signed three executive orders on Monday. The first calls for the attorney general to identify cities and states failing to comply with federal immigration laws, the second relates to protections for law enforcement officers, and the third is tied to English literacy for commercial truck drivers.\nTrump launched an aggressive enforcement campaign after taking office, surging troops to the southern border and pledging to deport millions of immigrants in theUnited Statesillegally.\nThe Republican president, who made immigration a major campaign issue in 2024, said the actions were needed after years of high illegal immigration under his predecessor, DemocratJoe Biden.\nWhite House officials at a press briefing touted a steep decline in illegal crossings at the border during Trump's first three months in office - even as concerns have emerged over the due process rights of immigrants and U.S. citizens swept up in the dragnet.\nThe U.S. Border Patrol arrested 7,200 migrants illegally crossing the border in March, the lowest monthly total since 2000 and down from a peak of 250,000 in December 2023.\n\"We have the most secure border in the history of this nation and the numbers prove it,\" Trump border czar Tom Homan said at the briefing.\nDemocrats and civil rights advocates have criticized Trump's heightened enforcement tactics, including the cases of several children who are U.S. citizens who were recently deported with their parents. One of the children has a rare form of cancer, according to the American Civil Liberties Union.\nHoman blamed the parents for putting their children at risk of deportation by remaining in the United States.\n\"If you choose to have a U.S.-citizen child, knowing you're in this country illegally, you put yourself in that position,\" he said.\nUnder the U.S. Constitution, anyone born in the country isautomatically granted citizenship, a right that Trump has tried to ban under an executive order he issued when he took office in January. The Supreme Court is due to hear arguments in the case next month.\nIn his first hundred days in office, Trump has moved tostrip legal immigration statusfrom hundreds of thousands of people, increasing the pool of those who can potentially be deported.\nWhile arrests of immigrants in the United States illegally have spiked, deportations remain below last year's levels under Biden when there were more people illegally crossing the border who could be quickly returned.\nDeportations were down in Trump's first three months in office from 195,000 last year to 130,000 this year, Reutersreportedlast week. Homan defended the figures and said it was not fair to compare them to Biden-era tallies.\nU.S. Immigration and Customs Enforcement detention facilities have been over capacity, with some 48,000 people in custody as of early April, beyond the funded level of 41,500.\nHomansaidthatTexasmilitary base Fort Bliss could be ready \"in the very near future\" to hold migrant detainees. The Trump administration has already been using the U.S. naval base in Guantanamo Bay, Cuba.\nPhotos posted on the White House lawn featured 100 people charged or convicted of serious crimes, including murder, rape and fentanyl distribution. Numerous studiesshowimmigrants do not commit crimes at a higher rate than native-born Americans.\nTrump has criticized cities and states that limit cooperation with federal immigration enforcement, labeling them \"sanctuaries\" and blaming them for releasing criminal offenders instead of coordinating their transfer to ICE.\nHis order on Monday said some state and local officials were engaging in a \"lawless insurrection against the supremacy of Federal law\" by obstructing immigration enforcement.\nA second order seeks to strengthen local law enforcement with better training, higher pay and benefits, and enhanced legal protections. It directs the attorney general to create a mechanism that would provide \"legal resources and indemnification to law enforcement officers who unjustly incur expenses and liabilities for actions taken during the performance of their official duties to enforce the law.\"\nA third order said proficiency in English should be a \"non-negotiable safety requirement for professional drivers\" and said his administration would enforce that requirement.\nLast week, a federal judgeblockedTrump's administration from withholding federal funding from more than a dozen so-called sanctuary jurisdictions that have declined to cooperate with Trump's hardline immigration crackdown.\nU.S. officialsarrestedaWisconsinjudge on Friday and charged her with helping a man in her court briefly evade immigration authorities. The arrest triggered backlash from Democrats and immigrant rights advocates who raised concerns that immigrant victims may not feel safe in courthouses.\nHoman defended the arrest, saying that the administration would enforce laws prohibiting harboring of a person in the United States illegally.\n“You will be prosecuted, judge or not,\" he said.\nAmericans are split on Trump’s immigration approach, but he has a 45% approval rating on immigration, better than other major issues, aReuters/Ipsos pollconducted in mid-April found."
}