[
  {
    "title": "Trump pick for Washington, DC, prosecutor won't get Senate vote before deadline, source says",
    "url": "https://www.reuters.com/world/us/trump-pick-washington-dc-prosecutor-wont-get-senate-vote-before-deadline-source-2025-05-06/",
    "publication_datetime": "2025-05-06T16:04:22Z",
    "publication_display": "May 06, 2025 | 04:04 PM UTC",
    "image_url": "https://www.reuters.com/resizer/v2/43OFT3XKMBIZ5ACPODKDKYWS7A.jpg?auth=6a0c4b3f177322f2c065c67e4dcf9d3794c3e162aa6c7438a58483696c6a74c6&height=1005&width=1920&quality=80&smart=true",
    "summary": [
      "Decision means Ed Martin could have to leave U.S. attorney post",
      "Nominee draws opposition over support for rioters, political advocacy",
      "White House calls nomination 'imperative'"
    ],
    "content": "WASHINGTON, May 6 (Reuters) - A U.S. Senate panel will not move forward with PresidentDonald Trump’spick for the top federal prosecutor in Washington, D.C. before his temporary appointment expires later this month, a source close to the nomination process told Reuters on Tuesday.\nThe decision means Ed Martin, who has been serving as the interim U.S. attorney in Washington since Trump returned to office in January, could at least temporarily have to leave his post.\nMartin has faced opposition, even from some Republicans, over his conduct in office, political advocacy and support for people who took part in the January 6, 2021 attack on the U.S. Capitol.\nThe Senate Judiciary Committee, which must approve the nomination, is not expected to act until May 22 at the earliest, two days after Martin's 120-day interim appointment will expire, the source said.\nIt marked a rare setback for a Trump nominee before the Republican-controlled U.S. Senate, which has largely approved Trump's picks since his original choice for attorney general -- former Representative Matt Gaetz -- dropped out of the running.\n\"Ed Martin is a fantastic U.S. Attorney for D.C. and will continue to implement the President's law-and-order agenda in Washington,\" White House spokesperson Alex Pfeiffer said.\nSpokespeople for Martin and Senator Chuck Grassley, the Republican chairman of the judiciary committee, did not immediately respond to requests for comment.\nAt least one Republican Senator, Thom Tillis of North Carolina, who serves on the judiciary committee, expressed misgivings about Martin. Others said they were still reviewing his record.\nU.S. law allows the federal District Court in Washington to appoint an interim U.S. attorney to serve until the Senate confirms a replacement. The court could decide to keep Martin in the role.\nMartin has presided over a turbulent period at the largest U.S. federal prosecutor’s office, which has included Trump'ssweeping pardonsfor nearly all accused of participating in the attack on the U.S. Capitol,firingsanddemotionsof prosecutors who worked on that investigation andunusual public threatsto investigate people opposed to Trump and his administration.\n\"His record makes clear that he doesn’t have the temperament or judgment for this job,\" Senator Dick Durbin of Illinois, the top Democrat on the judiciary committee, said during a May 1 meeting.\nMartin has touted a drop in violent crime in Washington during his tenure and portrayed himself as a crime fighter and loyal enforcer of Trump’s agenda. His open embrace of Trump marked a departure from tradition for U.S. attorneys, who typically avoid political statements and operate with a degree of independence.\nIn recent weeks, Martin moved a prosecutor tasked with handling local felony cases into his leadership team to assist with his confirmation, according to three people familiar with the matter. The people said it was unusual to assign a career prosecutor to work on a political matter.\nDemocrats called for a hearing on his nomination, a rare step for U.S. attorney roles, which typically are voted on without appearing before a Senate panel. Martin initially omitted prior appearances on Russian state-run media outlets in his written submissions to the committee.\nMartin oversaw the dismissal of all pending cases stemming from the Capitol riot, including one against adefendant he representedas a defense attorney.\nHe sent letters to several Democratic lawmakers who he said could be investigated over political rhetoric that could be construed as threatening and vowed to investigate interference withElon Musk’sgovernment cost-cutting team.\nMartin previously defended three former January 6 defendants in court and was a supporter of Trump’s false claims that the 2020 election had been stolen through voter fraud.\nHe faced criticism from Democrats over his ties to Timothy Hale-Cusanelli, an Army reservist convicted of storming the Capitol whom prosecutors described as a Nazi sympathizer, a claim Hale-Cusanelli's lawyer denied.\nMartin did not represent Hale-Cusanelli, but praised him publicly as a “great man” and a foundation Martin headed presented him with an award in 2024.\nMartin told the Senate panel in a written response that he condemned Hale-Cusanelli's past remarks and was not previously aware of them, even though the case received widespread attention."
  },
  {
    "title": "Order by Hegseth to cancel Ukraine weapons caught White House off guard",
    "url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/",
    "publication_datetime": "2025-05-06T14:46:10Z",
    "publication_display": "May 06, 2025 | 02:46 PM UTC",
    "image_url": "https://www.reuters.com/resizer/v2/FD7LMANMWZM7JAXPFB3AICTQJQ.jpg?auth=6b855c7f628fe36599cfaec6bae48a03b9308ec70636f2d5b2f4847db928524e&height=1005&width=1920&quality=80&smart=true",
    "summary": [
      "Hegseth's order caused confusion among national security officials",
      "White House claims Hegseth followed Trump's directive to pause aid",
      "Internal disputes have sometimes led to haphazard Ukraine policies"
    ],
    "content": "NEW YORK/WASHINGTON, May 6 (Reuters) - Roughly a week after Donald Trump started his second term as president, the U.S. militaryissued an orderto three freight airlines operating out of Dover Air Force Base in Delaware and a U.S. base in Qatar: Stop 11 flights loaded with artillery shells and other weaponry and bound for Ukraine.\nIn a matter of hours, frantic questions reached Washington from Ukrainians in Kyiv and from officials in Poland, where the shipments were coordinated. Who had ordered the U.S. Transportation Command, known as TRANSCOM, to halt the flights? Was it a permanent pause on all aid? Or just some?\nTop national security officials — in the White House, the Pentagon and the State Department — couldn’t provide answers. Within one week, flights were back in the air.\nThe verbal order originated from the office of Pete Hegseth, the secretary of defense, according to TRANSCOM records reviewed by Reuters. A TRANSCOM spokesperson said the command received the order via the Pentagon's Joint Staff.\nThe cancelations came after Trump wrapped up a January 30 Oval Office meeting about Ukraine that included Hegseth and other top national security officials, according to three sources familiar with the situation. During the meeting, the idea of stopping Ukraine aid came up, said two people with knowledge of the meeting, but the president issued no instruction to stop aid to Ukraine.\nThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\nAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\n“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\nThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\nAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\nThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\nThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\nReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\n“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\nThe stop in shipments caused consternation in Kyiv.\nThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\nThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of US military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\nThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the U.S. military's orders.\nThe revelations come at atime of upheavalin the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\nThe canceled flights contained weapons that hadlong been approvedby the Biden administration, authorized by lawmakers on Capitol Hill.\nReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\nFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\nTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\n“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.\nAccording to two sources with knowledge of the meeting, Hegseth arrived at the January 30 Oval Office meeting with Trump with a memo drafted by some of his top policy advisers, advocating that their boss push the White House to consider pausing weapons deliveries to Ukraine to gain leverage in peace negotiations with Russia.\nThe sources said the secretary attended the meeting with other top officials involved in Ukraine policy, including National Security AdviserMike Waltzand Ukraine envoy Keith Kellogg. The group broadly discussed U.S. policy on Ukraine and Russia, including potentially tightening sanctions on Moscow.\nIt’s not clear the extent to which Hegseth proposed stopping aid during the meeting, but the idea came up in discussions, said one of the sources and another person familiar with the meeting.\nSince the beginning of Russia’s full-scale invasion in February 2022, the U.S. had approved billions of dollars worth of military aid to Ukraine. Most was delivered under the Biden administration. But a few shipments remained in the pipeline, scheduled into this summer.\nTrump had threatened to freeze aid repeatedly on the campaign trail, but had yet to do so. And during the meeting, he again declined to stop aid to Ukraine or order Hegseth to implement any policy changes when it came to sending equipment to Kyiv, the sources said.\nAn order effectively freezing any military support for an ally would normally be discussed intensively among top national security officials and approved by the president. It requires the coordination of multiple agencies and often multiple freight companies.\nNone of that discussion or coordination happened when Hegseth’s office canceled the scheduled flights carrying American artillery shells and ammunition to Poland from Al Udeid military base in the United Arab Emirates and the Dover U.S. military base in Delaware, three of the sources said.\nThe pause came as Ukraine’s military was struggling to fend off Russian forces in eastern Ukraine and in the consequential battle for the Kursk region of Russia, where Ukrainian forces were losing ground and have since all but been expelled.\nClose Trump advisers got tipped off to the pause by Pentagon staffers and discussed with the president whether to restore the aid shipments, according to two sources. By then, TRANSCOM had canceled 11 flights, according to the records reviewed by Reuters. Some media outlets, including Reuters, wrote about the pause but Hegseth’s role was previously unknown.\nIt’s unclear if Trump subsequently questioned or reprimanded Hegseth. One source with direct knowledge of the matter said National Security Adviser Waltz ultimately intervened to reverse the cancelations. Waltz was forced out on Thursday and is expected to be nominated as U.S. ambassador to the United Nations.\nWhen Trump entered office, aid to Ukraine continued flowing and he pledged to work with Ukraine and Russia to end the war – or at the very least broker a ceasefire.\nTwo of his most prominent envoys, Kellogg, a supporter of Kyiv who worked with Trump in his first administration, and Steve Witkoff, a real-estate magnate and close friend of the president, set out to negotiate with both parties.\nSeparately, at the Pentagon, some of Hegseth’s policy advisers privately started drafting proposals to pull back American support for Ukraine, according to two sources briefed on the matter.\nThat group of staffers align themselves closely with the anti-interventionist philosophy.\nSome have previously advised Republican lawmakers advocating for an America-first approach to foreign policy and have called publicly, in writings and talks, for the U.S. to pull back from military commitments in the Mideast and Europe – a view similarly held by Vice President JD Vance. Several have advocated that the U.S. instead focus on China.\nSupporters of the staffers have slammed those pushing back on the anti-interventionist movement in the administration, claiming Vance and others are merely trying to save the lives of people living in warzones like Ukraine and prevent future American military deaths.\nThe infighting has complicated the policy-making process, according to a person familiar with the matter and four other sources. At a time when Kellogg and Witkoff are trying to broker a peace deal with Russia and Ukraine, the staffers have advocated behind the scenes for the U.S. to draw back its support for Kyiv – a policy that has angered Ukrainian officials and pressured European allies to fill the gap, five people with knowledge of the situation said.\nWashington hassigned a dealwith Kyiv for rights to its rare earth minerals – an agreement U.S. officials say is an attempt to recoup money America has spent to prop up Ukraine’s war effort.\nAt leastone of the staffers who had previously pushed for the administration to pull back its support for Kyiv, Dan Caldwell, was escorted out of the Pentagon for a leak he claims never happened. Caldwell, a veteran, served as one of Hegseth’s chief advisers, including on Ukraine.\nDespite the brief pause in February and the longer one that began in early March, the Trump administration has resumed sending the last of the aid approved under U.S. President Joe Biden. No new policy has been announced.\n(Corrects first paragraph to show US base is in Qatar, not UAE)"
  },
  {
    "title": "Rush to beat tariffs boosts US trade deficit to record high in March",
    "url": "https://www.reuters.com/world/us/us-trade-deficit-surges-record-high-march-2025-05-06/",
    "publication_datetime": "2025-05-06T16:27:44Z",
    "publication_display": "May 06, 2025 | 04:27 PM UTC",
    "image_url": "https://www.reuters.com/resizer/v2/S7LCP7JGKJO2NMD7NLOKYVL5QU.jpg?auth=e927ed220a5c1119603efd73ca0c434e7c640ac3c3b8d728e06482feb16fd38c&height=1005&width=1920&quality=80&smart=true",
    "summary": [
      "Trade deficit widens 14.0% to record $140.5 billion in March",
      "Goods imports accelerate 5.4% to all-time high of $346.8 billion",
      "Imports from China at lowest level in five years",
      "Imports from most countries were highest on record"
    ],
    "content": "WASHINGTON, May 6 (Reuters) - The U.S. trade deficit widened to a record high in March as businesses boosted imports of goods ahead of President DonaldTrump'ssweeping tariffs, which dragged gross domestic product into negative territory in the first quarter for the first time in three years.\nThe report from the Commerce Department on Tuesday showed the nation imported a record amount of goods from 10 countries, including Mexico and Vietnam. Imports from China were, however, the lowest in five years and could drop further as Trump has hiked duties on Chinese goods to a staggering 145%.\nThere are reports of a massive decline incargofrom China.\nWhile reciprocal tariffs with most U.S. trade partners were suspended for 90 days, duties on Chinese goods came into effect in early April, triggering a trade war with Beijing. Economists expect the front-running of imports probably persisted in April.\n\"Businesses are clearly scrambling as they try to find a way through this time of unprecedented change, but the worst is undoubtedly yet to come because the import tariff collections did not start to roll in earnest until after the White House 'Liberation Day' announcement on April 2,\" said Christopher Rupkey, chief economist at FWDBONDS. \"There are still no trade deals announced in Trump 2.0.\"\nThe trade gap jumped 14.0%, or $17.3 billion, to a record $140.5 billion, the Commerce Department's Bureau of Economic Analysis said. Economists polled by Reuters had forecast the trade deficit would rise to $137.0 billion.\nImports vaulted 4.4% to an all-time high $419.0 billion. Goods imports soared 5.4% to a record $346.8 billion. They were boosted by a $22.5 billion jump in consumer goods to an all-time high, mostly made up of pharmaceutical products from Ireland. Trump has promised to impose duties on pharmaceutical goods.\nCapital goods imports increased $3.7 billion to a record high, reflecting a solid rise in computer accessories. Imports of automotive vehicles, parts and engines increased $2.6 billion, driven by passenger cars.\nBut imports of industrial supplies declined $10.7 billion amid a $10.3 billion decrease in finished metal shapes, likely silver, and a $1.8 billion drop in non-monetary gold, which had accounted for the wider trade gap in the prior two months.\nEconomists said this data suggested capital flight out of the U.S. dollar as the White House's ever-changing tariffs policy spooked investors. Crude oil imports fell $1.2 billion.\n\"The post-November elections period from December 2024 to March 2025 saw a cumulative hoarding of offshore gold and silver bullion on a year-over-year basis of $92.5 billion,\" said Brian Bethune, an economics professor at Boston College. \"This 'parking' of scarce U.S. savings into non-productive, non-income earning assets has negative consequences for the U.S. dollar.\"\nThe dollar(.DXY), opens new tabhas weakened about 5.11% so far this year against the currencies of the main U.S. trade partners. The currency was trading lower against a basket of currencies on Tuesday.\nStocks on Wall Street also fell while U.S. Treasury yields were mixed.\nFederal Reserveofficials began a two-day policy meeting on Tuesday. While the U.S. central bank is expected to keep interest rates unchanged on Wednesday, Fed Chair Jerome Powell's press conference will be watched for clues on when policy easing might resume.\nExports climbed 0.2% to $278.5 billion, also a record high. Exports of goods increased 0.7% to $183.2 billion, the highest level since July 2022, lifted by industrial supplies and materials, which advanced $2.2 billion amid rises in natural gas and non-monetary gold.\nAutomotive vehicles, parts and engines exports increased $1.2 billion. But exports of capital goods decreased $1.5 billion, weighed down by a $1.8 billion decline in shipments of civilian aircraft. The goods trade deficit ballooned 11.2% to a record $163.5 billion in March.\nThe government reported last week that thetrade deficitcut a record 4.83 percentage points from GDP last quarter, resulting in the economy contracting at a 0.3% annualized rate, the first decline since the first quarter of 2022.\nTrump sees the tariffs as a tool to raise revenue to offset his promised tax cuts and to revive a long-declining U.S. industrial base. Economists expect the flood of imports to ebb by May, which could help GDP rebound in the second quarter.\nThey, however, caution that the lift from subsiding imports could be limited by a drop in exports as other nations boycott U.S. goods and travel. There has been a decrease in the number of visitors to the U.S., especially from Canada, in protest over the punitive tariffs as well as an immigration crackdown and Trump's musings about annexing Canada and Greenland.\nIndeed, exports of services fell $0.9 billion to $95.2 billion in March, pulled down by a $1.3 billion drop in travel.\nThe rush to beat tariffs saw imports from Mexico, the United Kingdom, Ireland, the Netherlands, Belgium, France, Germany, Italy, India and Vietnam hitting all-time highs. But imports from China were the lowest since March 2020, when the world was grappling with the first wave of the COVID-19 pandemic.\nThe seasonally adjusted goods trade deficit with China narrowed to $24.8 billion from $26.6 billion in February. The trade deficit with Canada also declined to $4.9 billion from $7.4 billion in February. The trade gap with Mexico was little changed, while the surplus with the UK narrowed.\n\"Imports from the EU were substantial in March, particularly from Ireland, and may decline in April,\" said Veronica Clark, an economist at Citigroup. \"But if anything, imports from some Asian countries may rise further as larger 40%-50% tariffs were delayed until July.\""
  },
  {
    "title": "Major universities sue to block Trump cuts to NSF research funding",
    "url": "https://www.reuters.com/world/us/major-universities-sue-block-trump-cuts-nsf-research-funding-2025-05-06/",
    "publication_datetime": "2025-05-06T14:13:16Z",
    "publication_display": "May 06, 2025 | 02:13 PM UTC",
    "image_url": "https://www.reuters.com/resizer/v2/2AGMKZR72JKRFJ6LYE3GPPRDM4.jpg?auth=7aa49f7c7aedcb6ee6d7de92010dbf7af87789d7ca47f515dd380df698de47b5&height=1005&width=1920&quality=80&smart=true",
    "summary": [],
    "content": "BOSTON, May 6 (Reuters) - Major U.S. universities have filed a lawsuit seeking to block PresidentDonald Trump'sadministration from carrying out steep cuts to federal research funding provided to academic institutions by the National Science Foundation.\nThelawsuit, opens new tabwas filed late on Monday in federal court in Boston by 13 schools including the Massachusetts Institute of Technology and Princeton University, as well as the Association of American Universities and two other academic trade groups.\nThey took aim at a decision NSF announced on Friday to cap reimbursement for indirect research costs at 15%, an action that mirrored funding cuts the National Institutes of Health and U.S. Department of Energy attempted that judges haveso far blocked.\n\"We are seeking to prevent implementation of this poorly conceived and short-sighted policy, which will only hurt the American people and weaken the country,\" the trade groups said in a joint statement.\nOther schools that joined the lawsuit include Brown University, the University of California, California Institute of Technology, Carnegie Mellon University, Cornell University, the University of Michigan and the University of Pennsylvania.\nNSF did not immediately respond to a request for comment.\nThe NSF funding cuts are part of the Trump administration's wide-ranging efforts to slash government spending, an effort overseen by the Elon Musk-spearheaded Department of Government Efficiency.\nNSF, a $9 billion agency that funds scientific research, has already canceled hundreds of grants out of step with the Republican president's priorities at a time when the administration has also beenfreezing billions of dollarsin government funding for numerous universities, including Harvard.\nNSF on Friday said that going forward it will cut the rate at which it reimburses research institutions for \"indirect costs\" related to achieving a scientific project's goals, such as computer systems, equipment and infrastructure.\nNSF said the rate cut was intended to \"streamline funding practices, increase transparency, and ensure that more resources are directed toward direct scientific and engineering research activities.\"\nBut the lawsuit argued NSF's action, if allowed to stand, \"will badly undermine scientific research at America's universities and erode our nation’s enviable status as a global leader in scientific research and innovation.\"\nThe lawsuit argued the policy was just as unlawful as the rate cuts that courts have blocked at NIH and the Energy Department, saying it violated statutes and federal regulations governing indirect cost rates."
  },
  {
    "title": "Exclusive: US cancels FDA bargaining session over layoffs, union says",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-fda-bargaining-session-over-layoffs-union-says-2025-05-06/",
    "publication_datetime": "2025-05-06T13:50:22Z",
    "publication_display": "May 06, 2025 | 01:50 PM UTC",
    "image_url": "https://www.reuters.com/resizer/v2/DEASYUL6ZJNQXFQNA5Y35URHBM.jpg?auth=7388245eec48db2a930f2a5ae687462f7240418ea0f11fda9d716e28a43f5928&height=1005&width=1920&quality=80&smart=true",
    "summary": [
      "Five-hour meeting with the FDA's largest workers union axed without explanation",
      "Union denied chance to bargain before April 1 layoffs",
      "Court injunction blocks Trump executive order on collective bargaining pending lawsuit outcome"
    ],
    "content": "May 6 (Reuters) - The Trump administration last week canceled the first bargaining session scheduled with the U.S. Food and Drug Administration's largest workers union since its ability to represent government staff was temporarily restored by a federal court, according one of the union's bosses.\nU.S. PresidentDonald Trumpin March signed an executive order that excluded agencies from collective bargaining obligations that he said \"have as a primary function intelligence, counterintelligence, investigative, or national security work.\"\nThe order applied to the FDA, as well as agencies under the Justice, State, Defense, Treasury and Veterans Affairs departments.\nSenior U.S. District Judge Paul Friedman on April 25issued an injunctionto block the executive order from being implemented, pending the outcome of a lawsuit by the National Treasury Employees Union (NTEU), which represents about 160,000 federal employees including as many as 9,000 FDA staff.\nThe Trump administration has appealed that injunction.\nA five-hour, virtual meeting between the union and the Department of Health and Human Services to discuss mass layoffs at the FDA was axed the evening before it was set to take place. No reason was given for the cancellation and no attempt was made to reschedule it, according to NTEU chapter president Anthony Lee.\nLee said the union had intended to address how the FDA had fired staff and raise union members' questions about terminations and severance pay, along with union proposals.\n\"We had maybe four or five pages of proposals to discuss during the meeting,\" Lee said.\nHHS, which oversees government health agencies including the FDA and Centers for Disease Control and Prevention, did not respond to requests for comment. The FDA website refers all queries to HHS.\nHealth Secretary Robert F. Kennedy Jr. directed the FDA to fire 3,500 employees as part of amassive restructuringof U.S. health agencies in March. HHS has said 20,000 of 80,000 employees have left the agency through layoffs, buyouts and early retirement offers spearheaded by billionaireElon Musk'sDepartment of Government Efficiency.\nThe union's contract with HHS says the government will provide an opportunity to bargain any and all impact and implementation issues related to layoffs, but the union was not given a chance to bargain before the April 1 layoffs.\nFederal labor law also requires agencies to bargain with unions in good faith over terms and conditions of employment.\nThe May 2 meeting had been set by HHS on April 23. No other collective bargaining sessions have been scheduled for this year, according to Lee.\nLee Adler, a labor lawyer and visiting lecturer at Cornell University, said it is a common strategy among employers to stall communications with unions until the court issues an order saying they are operating in bad faith.\n\"Until that occurs, it can be a strategy to delegitimize the union,\" he said.\nSamuel Estreicher, director of the Center for Labor and Employment Law at New York University, said the Trump administration is probably unwilling to engage in collective bargaining with unions of executive branches until a ruling is issued on its appeal to the April 25 blocking order.\nSome fired employees at the FDA, including those involved with renewing programs under which drugmakers provide user fees that pay for the agency's drug review system, have beenasked to returnto their jobs.\nLee said the administration also canceled a separate, contractually-obligated meeting with the union slated for the same day to discuss issues that are not typically covered in the collective bargaining agreement."
  }
]