[
  {
    "url": "https://thehill.com/homenews/state-watch/5318412-phil-robertson-died-duck-dynasty/",
    "datetime": "05/25/25 9:46 PM ET",
    "title": "Duck Dynasty star Phil Robertson, 79, dies",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2025/05/AP101241350763-e1748223875482.jpg?w=1399&h=788&crop=1",
    "subheadline": "In this photo taken May 29, 2014, Phil Robertson speaks in New Orleans, La.  Republican presidential candidate, Sen. Ted Cruz, T-Texas, has bagged the endorsement of “Duck Dynasty” star Phil Robertson after going hunting with him.  (AP Photo/Bill Haber)",
    "article_text": "Phil Robertson, the star of “Duck Dynasty,” has died at the age of 79.\nRobertson’s family announced his death in a post on Facebook.\n“We celebrate today that our father, husband, and grandfather, Phil Robertson, is now with the Lord,” the post read.\n“He reminded us often of the words of Paul, ‘you do not grieve like those who have no hope. For we believe that Jesus died and rose again, and so we believe that God will bring with Jesus those who have fallen asleep in him.’“Thank you for the love and prayers of so many whose lives have been impacted by his life saved by grace, his bold faith, and by his desire to tell everyone who would listen the Good News of Jesus. We are grateful for his life on earth and will continue the legacy of love for God and love for others until we see him again,” the statement said.\n“Duck Dynasty” centered on the Robertson family and their duck-calling business. It aired on A&E from 2012 to 2017, though a reboot of the series was set for 2025.\nPhil Robertson was the president of the family business, Duck Commander.\nRobertson was an evangelical Christian and conservative who sometimes dipped into political issues. HeendorsedSen. Ted Cruz (R-Texas) in the 2016 presidential contest.\n“My qualifications for president of the United States are rather narrow: Is he or she Godly, does he or she love us, can he or she do the job and, finally, would they kill a duck and put him in a pot and make him a good duck gumbo?” Robertson said in a video at the time. “Cruz fits the bill.”\nHis family said they would be holding a private service but that it would also be sharing details for a public celebration of Robertson’s life."
  },
  {
    "url": "https://thehill.com/homenews/state-watch/5318152-chicago-mayor-accuses-trump-bully/",
    "datetime": "05/25/25 4:08 PM ET",
    "title": "Chicago mayor calls DOJ investigation into hiring a ‘clear demonstration’ of intimidation",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2024/08/AP24229423414228-e1724091485266.jpg?w=1400&h=789&crop=1",
    "subheadline": "Chicago Mayor Brandon Johnson responds to a question during an interview with The Associated Press on Aug. 15, 2024.",
    "article_text": "Chicago Mayor Brandon Johnson (D) accused the Trump administration on Sunday of bullying his city after theDepartment of Justice(DOJ) flagged it for potential racial discrimination in hiring city workers.\n“This is a clear demonstration of not just animus, but intimidation,”Johnson saidduring an interview on MSNBC’s “The Weekend.”\nThe DOJ’s Civil Rights Divisionlaunched an investigationinto the city’s hiring practices on Monday after Johnson touted Black city leaders during remarks at the Apostolic Church of God in Chicago last weekend.\n“There are some detractors that will try and push back on me and say, ‘The only thing the mayor talks about is the hiring of Black people.’ No. What I’m saying is, when you hire our people, we always look out for everybody else,” Johnson, who is Black,told the congregationin remarks that went viral online.\nAssistant Attorney General Harmeet Dhillonsent a letter to Johnsonon Monday that cited those remarks as “suggesting that you have made hiring decisions solely on the basis of race.”\n“If these kinds of hiring decisions are being made for top-level positions in your administration, then it begs the question whether such decisions are also being made for lower-level positions,” Dhillon, an ally of President Trump who unsuccessfully ran to lead the Republican National Committee in 2023, wrote in the letter. “We intend to consider all relevant information, and we welcome your assistance in helping to identify what that might be.”\nJohnson called the move “dramatic” and accused Trump of trying to “stifle and silence the voice of resistance.”\n“We remain firm that we will not be intimidated by this tyrant,” Johnson said. “His actions have certainly been inimical to the interest of working people, but we’re not going to cower to his hostility.”"
  },
  {
    "url": "https://thehill.com/opinion/healthcare/5316857-opioid-crisis-funding-naloxone/",
    "datetime": "05/25/25 3:00 PM ET",
    "title": "Congress can decrease opioid deaths, but it will require more investment",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2025/05/AP24348521127940-1.jpg?w=1024&h=683&crop=1",
    "subheadline": "FILE – OxyContin pills arranged for a photo at a pharmacy, Feb. 19, 2013 in Montpelier, Vt.   (AP Photo/Toby Talbot, File)",
    "article_text": "Illicit fentanyl and other synthetic opioids continue to devastate communities across America. Accidental opioid overdoseremains the leading cause of death for Americans 18 to 44and senior citizens are seeing a troubling rise in opioid overdoses.\nThe nationwide decline in opioid overdose deaths reported at the end of 2024 was promising. Still, the 80,000 Americans who died from this crisis remains too many. Congress must not see the decline in overdose deaths as the finish line. It should view them as an opportunity to double down on the strategies we’ve seen saving lives in communities nationwide.\nWhen I served as secretary of Health and Human Services, the department took a broad, locally led approach to combatting opioid deaths. We worked to deploy nearly half a billion dollars in grants to states. We recognized that states and local communities were in the best position to decide what worked for them.\nWhether it’s investing in drug prevention education at schools, increasing the availability of addiction treatment services, or supporting first responders, our role was to give them the support they needed to save lives, not to micromanage their efforts. That principle still holds. Washington should not dictate a one-size-fits-all solution to addiction. Instead, it should reinforce the tools that have already been shown to work on the ground.\nAmong those tools is naloxone, a medication that can reverse an opioid overdose when administered promptly. It’s not a cure for addiction, and it shouldn’t be treated as such. But when someone is overdosing, naloxone is the lifesaving bridge that can at least buy more time — for parents to get their children into treatment or for law enforcement to intervene. It buys more time for a second chance.\nIn 2017, we helped expand access to naloxone for first responders and caregivers. Today, this tool remains a basic part of any practical overdose response toolkit, but many states and localities are experiencing shortages of it. The fiscal 2026 budget should fix that.\nIt should also help accelerate the use of prescription drug monitoring programs. These are state-run databases that track prescriptions for controlled substances and help flag dangerous patterns, like doctor shopping or excessive refills.\nPrescription drug monitoring programs don’t interfere with clinical decision-making, and they give prescribers valuable information that can help reduce unnecessary or duplicative opioid prescribing. Most states now operate robust prescription drug monitoring programs, and when used consistently, they’ve been shown to reduce opioid-related deaths. Supporting these systems with modest federal investment would represent a commonsense step that could yield a strong return.\nOf course, funding emergency tools alone is not enough. What often gets lost in the political debate is the importance of long-term solutions — building up treatment capacity, ensuring providers are trained and supported, and reducing the barriers people face when they seek help. Many states are already making progress in this area, but without reliable federal support, that progress can stall.\nThat’s why it’s so important that the fiscal 2026 budget reflect a clear, bipartisan commitment to fighting opioid addiction with a combination of compassion and discipline. Compassion, because we are dealing with human lives and families in crisis. Discipline, because not every flashy program is effective — and because every dollar spent should be measured against real outcomes.\nI understand the need for fiscal responsibility. As a former Budget Committee chair in Congress and a physician, I’ve long believed that we must be judicious in how we allocate resources. But there is nothing fiscally responsible about letting preventable deaths continue because we failed to invest in interventions that are proven to work. Nor is there anything conservative about ignoring the safety, health and security consequences of an unchecked addiction and fentanyl epidemic.\nCongress has an opportunity to recommit to a smarter approach. Not one that is overly centralized or politicized, but one that empowers local communities, respects the dignity of those struggling with addiction, and insists on measurable results.\nWe’ve made progress before. With the right balance of resources, leadership and humility, we can do it again.\nDr. Tom Price served as the 23rd U.S. secretary of Health and Human Services and a member of Congress from Georgia from 2005 to 2017, including as chair of the House Budget Committee from 2015 to 2017."
  },
  {
    "url": "https://thehill.com/opinion/civil-rights/5317130-free-speech-fights-antisemitism/",
    "datetime": "05/25/25 4:00 PM ET",
    "title": "Don’t use censorship to fight antisemitism",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2025/05/AP25142803456820.jpg?w=1024&h=683&crop=1",
    "subheadline": "U.S. Attorney Jeanine Pirro speaks on an update on charges related to the deadly shooting of Israeli Embassy staff during a news conference at the Attorney General office for the District of Columbia in Washington, Thursday, May 22, 2025. (AP Photo/Jose Luis Magana)",
    "article_text": "I am Jewish, and I am afraid.\nOn Wednesday night, two young staffers at the Israeli embassy were killed outside of a Jewish museum in Washington, D.C. by a man who chanted, “Free, free Palestine!” afterward. That comes on the heels ofattacks on Israeli embassies and consulatesin Mexico, Serbia, Denmark and Germany.\nIt’s part of aworldwide uptick in antisemitic violencesince the Hamas assault on Israel in October 2023.\nBut I’m also afraid of censorship, which is the enemy of democracy in all times and places. On our college campuses, especially, free expression is under fire from the White House and its spineless accomplices in university leadership. And I fear that these horrific murders in Washington will make it yet more difficult for any of us to speak our minds.\nWitness recent events at George Washington University and New York University, wheregraduation speakers were penalizedfor criticizing Israel’s mass killings in Gaza. The offending orator at George Washington was banned from campus. NYU withheld its speaker’s diploma.\nOstensibly, the two students were sanctioned for departing from their pre-approved speeches. But everyone knows the real reason: Our universities are cowering before the Trump administration, which has already withheld millions of federal dollars from Columbia and Harvard for allegedly failing to fight antisemitism in their ranks.\nAnd last week, the administration barred Harvard from enrolling international students on the grounds that it had allowed “anti-American, pro-terrorist” foreigners to “harass and physically assault” other people on campus, asHomeland Security Secretary Kristi Noem charged.\nLet’s be clear: harassment and assault are illegal. So are all forms of physical violence. Anyone who engages in those acts — on our campuses, or outside of them — should be held criminally responsible.\nBut it is not illegal, in a democracy, to shout “Free Palestine” or “Globalize the Intifada.” I understand why critics regard those chants as hateful; depending on the context, I might find these words hateful myself.\nYet words are not violence. And once we lose sight of that distinction, free speech will become a dead letter. You can censor anything you don’t like, on the grounds that it promotes violent behavior.\nBlack Lives Matter? In 2016, a Black gunman whokilled five police officers in Dallasinvoked the phrase. It was also a watchword for protesters who burned down several police stations following the murder of George Floyd in 2020. So we would need to shut down Black Lives Matter, lest it inspire yet more mayhem.\nTucker Carlson? His “replacement theory” — that whites were being pushed out by non-whites — was said to haveinspired the white shooter who murdered ten African-Americans in Buffalo in 2022. Shut him down, too?\nSalman Rushdie’s “The Satanic Verses” sparked riots around the world, and — most recently — anear-fatal assault on Rushdie himself. His attacker believed Rushdie’s book maligns Muslims. Shall we censor him, too?\nAnd while you’re at it, censor any speech you think is antisemitic. “For those who claim ‘globalize the intifada’ is peaceful and not antisemitic, the horrifying shooting of two Jewish adults is proof that you are wrong,”declared Daniel Rosen, president of the American Jewish Congress, after the shootings in Washington. “Just because one person pulled the trigger doesn’t mean they acted alone.”\nBut just because one person used a phrase in an awful antisemitic act doesn’t mean that everyone who uses the same phrase is antisemitic. And it certainly doesn’t mean we should muzzle or penalize people for saying it.\nAlas, that’s where we’re heading. And the only way to head that off is to rededicate ourselves to free speech for everyone, even when we think it’s hateful.\nThat doesn’t mean we should keep quiet about it. To the contrary, we need to speak out against hate wherever we see or hear it. Antisemitism is real, and it is rising. The only way to stop it is to raise our voices in opposition to it.\n“Speak up or let it happen again,” the Israeli Foreign Ministry urged, in avideoit posted following the fatal shootings in Washington. “Because ‘never again’ means nothing if we stay silent.”\nThat’s exactly right. But free speech means nothing if we can stamp out anything we fear or despise. You can’t have a democratic society — or a democratic university — on those grounds. It’s a lesson we need to learn, over and over again, until we know it by heart.\nJonathan Zimmerman teaches history and education at the University of Pennsylvania and serves on the advisory board of theAlbert Lepage Center for History in the Public Interest."
  }
]
