[
  {
    "url": "https://www.politico.com/news/2025/05/18/trump-foreign-investments-00355202",
    "headline": "Trump touts flood of foreign investments, but local economic officials aren’t yet seeing it",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 18, 2025 – 07:00 AM EDT",
    "article": "President Donald Trump talks before signing guest book at the Abrahamic Family House, May 16, 2025, in Abu Dhabi, United Arab Emirates.  | Alex Brandon/AP\nByDaniel Desrochers\n05/18/2025 07:00 AM EDT\nLink Copied\nPresident Donald Trump has claimed his surge of new tariffs will produce trillions of dollars of foreign investments in the U.S. economy. But some of the people working to lure those investments to U.S. cities and states say they’re not seeing the investment boom, at least not so far.\nTo the contrary, economic development officials and lawmakers from several states say that the uncertainty fueled by Trump’s on-again, off-again trade wars is keeping many foreign businesses from pouring money into the U.S. market right now. And it signals the uneven impact the tariffs are having on reshoring American manufacturing — Trump’s stated goal for raising rates to the highest levels in a century.\n“One of our contacts described it to me as driving a car in the fog,” Lee Lilley, North Carolina’s Commerce Secretary, said in an interview Tuesday at the Commerce Department’s SelectUSA Summit, an annual conference aimed at promoting foreign investment in the U.S.“You’re driving along, the fog descends, you slow the car down. Depending on how bad the fog is, you might pull the car over and turn on the blinkers. And we feel like we’re in that space a little bit.”",
    "image": "https://www.politico.com/dims4/default/f1d5ce7/2147483647/strip/true/crop/3549x2366+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F72%2Fca%2Fce4b963b4e638be8976301bb5a1e%2Ftrump-mideast-03542.jpg"
  },
  {
    "url": "https://www.politico.com/www.politico.eu/article/china-slaps-anti-dumping-trade-tariff-duties-on-plastics-from-us-eu-japan-and-taiwan/",
    "headline": "China slaps anti-dumping duties on plastics from US, EU, Japan and Taiwan",
    "subheading": "Our readers read next",
    "date": "N/A",
    "article": "China on Sunday announced anti-dumping duties as high as 74.9 percent on imports of POM copolymers, a type of engineering plastic, from the United States, the European Union, Japan and Taiwan, Reuters reported.\nThe Chinese commerce ministry's findings conclude a probe launched in May 2024, shortly after the U.S. sharply increased tariffs on Chinese electric vehicles, computer chips and other imports, according to theReuters report.\nPOM copolymers can partially replace metals such as copper and zinc and have various applications, including in auto parts, electronics and medical equipment, according tothe ministry.\nThe highest anti-dumping rates of 74.9 percent were levied on imports from the United States, while European shipments will face 34.5 percent duties, according to the report.\nBeijing's move comes after the U.S. and Chinacooled their trade waron May 12 by agreeing to slash punitive tariffs against each other in a 90-day truce. The suspension allows time for further negotiations.",
    "image": "https://www.politico.eu/cdn-cgi/image/width=1160,height=773,quality=80,onerror=redirect,format=auto/wp-content/uploads/2025/05/18/13002426-scaled.jpg"
  },
  {
    "url": "https://www.politico.com/news/2025/05/17/one-person-killed-in-explosion-outside-fertility-clinic-police-say-act-was-intentional-00355483",
    "headline": "1 person killed in explosion outside fertility clinic; FBI says blast was an ‘act of terrorism’",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 17, 2025 – 08:31 PM EDT",
    "article": "Debris covers the ground after an explosion on May 17, 2025, in Palm Springs, California. | ABC7 Los Angeles via AP\nByAssociated Press\n05/17/2025 08:31 PM EDT\nUpdated:05/17/2025 10:09 PM EDT\nLink Copied\nAn explosion killed a person and heavily damaged a fertility clinic Saturday in the upscale California city of Palm Springs in what the FBI characterized as an “intentional act of terrorism.”\nAkil Davis, the head of the FBI’s Los Angeles field office, said in the evening that the clinic was deliberately targeted, while declining to elaborate on how authorities have reached a conclusion on a motive.\nAuthorities were still working to confirm the identity of the person who died at the scene. Davis would not directly say whether that person was the suspect but said authorities were not searching for a suspect.",
    "image": "https://www.politico.com/dims4/default/44bff05/2147483647/strip/true/crop/2993x1706+0+0/resize/630x359!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F48%2F55%2F37d12ca04623aedf1bfaa1e1743f%2Fcalifornia-explosion-75835.jpg"
  },
  {
    "url": "https://www.politico.com/www.politico.eu/article/russia-drone-kills-9-civilians-ukraine-hours-after-bilateral-talks/",
    "headline": "Russian drone kills 9 civilians on Ukrainian bus hours after bilateral talks",
    "subheading": "Our readers read next",
    "date": "N/A",
    "article": "Nine people were killed and seven were injured on Saturday in a Russian drone attack on a bus carrying civilians in northeastern Ukraine, according to local officials.\nThe strike occurred less than 24 hours after Ukrainian and Russian representatives held their first talks since just after the start of Moscow’s large-scale invasion of Ukraine more than three years ago. During the meeting, which took place in Istanbul, the two sides did not reach a peace deal, but theyagreed to exchange1,000 war prisoners.\nThe attack occurred near the town of Bilopillia, in Sumy Oblast, a Ukrainian region bordering Russia. Ukrainian police confirmed the strike andreleased photosof the bus, whose roof was torn off by the explosion.",
    "image": "https://www.politico.eu/cdn-cgi/image/width=1160,height=773,quality=80,onerror=redirect,format=auto/wp-content/uploads/2025/05/17/GettyImages-2211724187-scaled.jpg"
  },
  {
    "url": "https://www.politico.com/news/2025/05/17/trump-to-speak-with-putin-zelenskyy-on-monday-00355424",
    "headline": "Trump to speak with Putin, Zelenskyy on Monday",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 17, 2025 – 12:07 PM EDT",
    "article": "President Donald Trump walks down the stairs of Air Force One upon his arrival at Joint Base Andrews, Maryland, on May 16, 2025. | Luis M. Alvarez/AP\nByAli Bianco\n05/17/2025 12:07 PM EDT\nLink Copied\nPresident Donald Trump announced he’ll be speaking with Russian President Vladimir Putin — and then with Ukrainian President Volodymyr Zelenskyy shortly after — as he looks to broker a deal to end the war in Ukraine.\nNegotiations on the war that Trump promised to end on “Day One” of his term have dragged on over the last four months, with the administration’s patience growing thinner as Russia’s ground operation in Ukraine continues despite global calls for a ceasefire.\nNow, Trump said he’ll be talking with both parties, and other key leaders from NATO, on Monday morning to stop the “bloodbath.”",
    "image": "https://www.politico.com/dims4/default/4b6abc3/2147483647/strip/true/crop/5750x3834+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F84%2F71%2Fd4bdb3694729b20d9385a02dbe3f%2Ftrump-26936.jpg"
  },
  {
    "url": "https://www.politico.com/www.politico.eu/article/israel-launch-new-operation-gaza-us-trump-leaves-middle-east/",
    "headline": "Israel launches new operation in Gaza after Trump leaves Middle East",
    "subheading": "Our readers read next",
    "date": "N/A",
    "article": "The Israeli military on Friday night announced the start of “extensive strikes” and troop mobilization in the Gaza Strip as part of a new military operation named “Gideon’s Chariots.”\nThe major operation aims “to achieve all the goals of the war in Gaza, including the release of the hostages and the defeat of Hamas,” the Israel Defense Forces (IDF)saidon social media.\nNew strikes began on the same day that U.S. President Donald Trump concluded his four-day trip to the Middle East, visiting Saudi Arabia, Qatar and the United Arab Emirates.",
    "image": "https://www.politico.eu/cdn-cgi/image/width=1160,height=773,quality=80,onerror=redirect,format=auto/wp-content/uploads/2025/05/17/12583721-scaled.jpg"
  },
  {
    "url": "https://www.politico.com/news/2025/05/16/trump-administration-another-error-high-profile-deportation-00355377",
    "headline": "Trump administration acknowledges another error in a high-profile deportation",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 16, 2025 – 10:38 PM EDT",
    "article": "Demonstrators wave Mexican flags during a protest calling for immigration reform, Feb. 2, 2025, in Los Angeles. Eric Thayer | AP\nByKyle Cheney\n05/16/2025 10:38 PM EDT\nLink Copied\nWhen a Guatemalan man sued the Trump administration in March for deporting him to Mexico despite afear of persecution, immigration officials had a response: The man told them himself he was not afraid to be sent there.\nBut in a late Friday court filing, the administrationacknowledgedthat this claim — a key plank of the government’s response to a high-stakesclass action lawsuit— wasbased on erroneous information.\nImmigrations and Customs Enforcement officials now say they have no record of anyone being told by the man, identified only by the initials O.C.G. in court papers, that he was unafraid of going to Mexico. The error, they say, was attributable to a “software tool” known as ICE’s “ENFORCE alien removal module” that tracks individual deportation cases and allows staff to insert comments.",
    "image": "https://www.politico.com/dims4/default/227342f/2147483647/strip/true/crop/4163x2775+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F89%2F65%2F45ae5ca04019982131b2b8a6c2eb%2Fimmigration-under-trump-photo-gallery-65646.jpg"
  },
  {
    "url": "https://www.politico.com/news/2025/05/16/appeals-court-federal-worker-unions-00355375",
    "headline": "Appeals court lifts block on Trump executive order targeting federal worker unions",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 16, 2025 – 08:39 PM EDT",
    "article": "A D.C. Circuit panel handed President Donald Trump an incremental win in a dispute over his effort to strip federal government workers of union representation. | Francis Chung/POLITICO\nByJosh Gerstein\n05/16/2025 08:39 PM EDT\nLink Copied\nA federal appeals court has lifted a lower-court order that prevented the federal government from implementing President Donald Trump’s plan to end collective bargaining by workers at more than a dozen federal agencies.\nIna 2-1 rulingFriday, the D.C. Circuit Court of Appeals said U.S. District Court Judge Paul Friedman appeared to have erred last month when he froze Trump’s executive order on the subject.\nThe appeals court’s majority said there was insufficient evidence that the National Treasury Employees Union faced “irreparable harm” that would justify the preliminary injunction, Friedman said in his ruling.",
    "image": "https://www.politico.com/dims4/default/44ee835/2147483647/strip/true/crop/4000x2667+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F34%2F64%2F22608e5d46b381218fa910e9b5e1%2Fe-barrett-prettyman-courthouse-95440.jpg"
  },
  {
    "url": "https://www.politico.com/news/magazine/2025/05/16/canada-ambassador-trump-51st-state-interview-00353689",
    "headline": "‘It’s Outrageous That You Banned American Products From Your Shelves’",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 16, 2025 – 02:00 PM EDT",
    "article": "OTTAWA —Pete Hoekstra thumbs through an imaginary document, and pauses for effect: “This is a serious proposal — pile one.” Then he raises a second document. “I can’t believe this,” he guffaws. “This is a joke.” Straight to the discard pile.\nThat, says President Donald Trump’s ambassador to Canada, is how it will go — one way or another — when newly elected Prime Minister Mark Carney submits a proposal on a revamped economic and security agreement with the United States.\n“The ball’s in your court,” Hoekstra told POLITICO Magazine in a Thursday sit-down at the U.S. Embassy.",
    "image": "https://www.politico.com/dims4/default/bdcd684/2147483647/strip/true/crop/4500x3000+0+0/resize/1290x860!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd7%2Ffe%2F698624984398b154e294818a0dda%2Fwhite-house-92110.jpg"
  },
  {
    "url": "https://www.politico.com/news/2025/05/17/bleak-budgets-shadow-newsom-2028-ambitions-00355255",
    "headline": "Bleak budgets shadow Newsom’s 2028 ambitions",
    "subheading": "WASHINGTON & POLITICS",
    "date": "May 17, 2025 – 10:00 AM EDT",
    "article": "A series of budget deficits will test Newsom's relationships with key allies |  AP/Rich Pedroncelli\nByJeremy B. White\n05/17/2025 10:00 AM EDT\nLink Copied\nSACRAMENTO, California — Gavin Newsom’s final years of overseeing a massive state budget will be lonely ones.\nThe California governor, who has less than two years left in his last term and is widely considered a potential 2028 presidential contender, is facingintense backlashfrom close political allies over his plan to close a $12 billion shortfall — which included deep cuts to Planned Parenthood and health care for undocumented immigrants. Next year could be even worse as forecasters project deficits for years to come.\nIn a bitter twist, his nemesis in the White House is forcing many of these painful choices, ensuring months of brutal headlines for the ambitious Democrat. Economic upheaval from President Donald Trump’s trade policies, on top of yet-undetermined federal funding cuts, will likely drag state spending talks into the fall — a connection Newsom made clear as hereleased his planwith a reference to the “Trump slump.”",
    "image": "https://www.politico.com/dims4/default/aebd120/2147483647/strip/true/crop/3871x2580+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fc6%2F05%2Fca3440d34136992a687d710c69da%2Fcalifornia-budget-88296.jpg"
  }
]