[
  {
    "url": "https://www.politico.com/news/2025/04/28/caroll-hegseth-pentagon-00312849",
    "headline": "‘Tale of 2 Petes’: Fired adviser describes Pentagon chief consumed by image",
    "subheading": "WASHINGTON & POLITICS",
    "date": "April 28, 2025 – 12:43 PM EDT",
    "article": "Defense Secretary Pete Hegseth prepares to give a television interview at the White House on March 21. | Jacquelyn Martin/AP\nBy Paul McLeary and Jack Detsch\n04/28/2025 12:43 PM EDT\nUpdated: 04/28/2025 01:28 PM EDT\nLink Copied\nA former top adviser to Defense Secretary Pete Hegseth described a head office gripped by paranoia and more focused on photo ops than leadership, the latest in a series of brutal accusations about the inner workings of the Pentagon.\nColin Carroll, who was fired this month from his post as chief of staff to the deputy Defense secretary, told the Megyn Kelly podcast that Hegseth was obsessed with the spread of leaks and spent half his time investigating them at the detriment of defense priorities.\n“He was very focused on the leaks, and I think it kind of consumed the team a little bit,” said Carroll, who was terminated amid a leak probe. “If you look at a pie chart of the secretary’s day, at this point, 50 percent of it is probably a leak investigation.”\n\nHis ouster came after a vicious brawl among Hegseth’s top advisers, including Joe Kasper, his former chief of staff. Hegseth’s senior adviser, Dan Caldwell, and deputy chief of staff Darin Selnick were also fired during the leak investigation. Kasper left the department last week.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nThis is a modal window.\nCarroll portrayed a secretary intent on maintaining a public image of competence and control. Hegseth’s staff often films his early morning workouts with troops, which Carroll said was partly an attempt to push back against the idea of Hegseth as undisciplined and a heavy drinker — allegations that trailed him during his confirmation hearing and which he denied.\n“In order to combat that image, it’s ‘hey, I’m gonna go work out with the troops,’” Carroll said. ”While that is important — and it’s a thing to do to get out there and helps recruiting and helps morale — if you’re taking a half day trip to the Naval Academy at the same time the budget is due, and we really need some support here … come on, you gotta weigh priorities.”\n\nPentagon spokesperson Sean Parnell pointed to the increased number of troops on the southern border, the bombing campaign against the Houthis in Yemen, and contracts canceled by DOGE as signs of progress. “Secretary Hegseth has delivered more change to the DOD in 100 days than most secretaries have in four years,” he said. While the media “focuses on gossip, we’re focused on results.”\nThe ousted adviser described a “tale of two Pete’s” in Hegseth’s behavior, a straight-talking leader able to convince skeptical Republicans to boost higher defense spending, and a Pentagon chief fixed on “weird details” who could get “very agitated” in internal meetings.\nCarroll said that Deputy Defense Secretary Steve Feinberg assured Carroll he would not be ousted, even after the others were suspended. Carroll said he “very much” wants to return to DOD to work with Feinberg.\nHegseth, after losing his office’s most senior advisers, has relied on a smaller group that includes his wife, his personal lawyer and a former junior military aide.\nThe Defense Department on Thursday announced three new Hegseth advisers: the former military aide, Col. Ricky Buria; Justin Fulcher, a tech entrepreneur and DOGE adviser; and Patrick Weaver, who worked on Capitol Hill and the Department of Homeland Security in President Donald Trump’s first term but has no Pentagon experience.\nTrump, in an interview with The Atlantic published Monday , indicated that he’s closely following the issues with Hegseth’s team.\n“He’s gonna get it together,” Trump said. “I had a talk with him, a positive talk, but I had a talk with him.”",
    "image": "https://www.politico.com/dims4/default/c6e52e4/2147483647/strip/true/crop/5616x3744+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F54%2F67%2Fdd864ee34ad68857831fd0af9f45%2Ftrump-100-days-40657.jpg"
  }
]